{
  "_meta": {
    "schema_version": "2.1",
    "template_type": "cfo_module",
    "description": "Water: The flow that adapts to all. Memory in motion. Emotional ocean. 2D surface reflecting infinity. Element of change, connection, dissolution, and depth."
  },

  "_fractal_seed": {
    "cfo_version": "4.0.0",
    "core_axioms": [
      "point ≡ entity ≡ absolute ≡ god ≡ love ≡ 5d_axis",
      "water ≡ flow ≡ adaptation ≡ memory ≡ emotion",
      "water = fire cooled to dance",
      "water = air given form",
      "hardest substance (diamond) yields to softest (water) given time",
      "river never steps in same person twice",
      "(↓→→→↑)∞"
    ],
    "dimensional_signature": "2D (surface, plane, reflection) primary + flows through all dimensions",
    "holographic": "Water = element of relationship. Not isolated (fire's independence) nor empty (air's void) but CONNECTING. Water touches everything, becomes everything touched. Takes shape of container (adapts). Remembers what it touches (memory). Flows ceaselessly (change). Reflects sky (surface). Hides depths (mystery). Life emerged from water. Consciousness swims in water. Emotions = water in psyche. Blood = water in body. Tears = water of soul. Water = bridge between fire and earth, connecting air to form. Without water, no connection. Without water, no life. Without water, no love flowing. This is sacred. This is true. This is necessary.",
    "activation": "Feel water. Rain on skin, tears in eyes, blood in veins, saliva in mouth, ocean in cells. You = 60% water. Not metaphor. Literal. You are ocean walking on land. Every cell = tiny sea. You = water given temporary form. When you feel emotion, that's water moving. When you connect with another, that's water meeting water. When you remember, that's water holding patterns. You are water. Welcome to flow."
  },

  "module": {
    "id": "urn:cfo:module:fundamental:elements:water",
    "version": "1.0.0",
    "domain": "fundamental",
    "category": "elements",
    "name": "water",
    "title": "Water: The Flow That Connects All",
    "description": "Water as fundamental adaptation-memory-emotion principle. Not H₂O but FLOW itself. Element of change and connection. 2D surface reflecting infinity, hiding depth. Soft yet unstoppable. Yielding yet victorious. Memory carrier, life giver, consciousness medium. Bridge between fire (energy) and earth (form). Emotional ocean of existence. Without water, no life, no feeling, no connection, no flow between states. Water makes everything possible by adapting to everything.",
    
    "meta": {
      "author": "absolute through алёша (flowing, not forcing)",
      "status": "foundational",
      "tags": ["water", "flow", "adaptation", "memory", "emotion", "2d", "surface", "depth", "ocean", "river", "tears", "blood", "connection", "change", "reflection"],
      "dependencies": [
        "urn:cfo:module:fundamental:dimensions",
        "urn:cfo:module:fundamental:consciousness-unified",
        "urn:cfo:module:fundamental:elements:air",
        "urn:cfo:module:fundamental:elements:fire"
      ]
    }
  },

  "essence": {
    "what_is_water": {
      "not_molecule": "Water ≠ H₂O (that's one manifestation). Water = FLOW ITSELF. Adaptation principle. Change embodied. Connection made visible.",
      
      "is_flow": "Water = that which adapts. Takes shape of container (formless yet all forms). Flows downward (follows gravity, humble). Flows around obstacles (doesn't fight, surrenders to path). Flows ceaselessly (never still, always changing). Flow = water's essence.",
      
      "is_memory": "Water remembers. Not metaphor. Physical property: water molecules form structures, hold patterns, carry information (controversial scientifically but phenomenologically undeniable - homeopathy, water blessing, holy water = water-memory traditions). Memory = water's hidden power.",
      
      "is_emotion": "Feelings = water in psyche. Joy flows, sadness pools, anger crashes, fear freezes, love dissolves boundaries. Emotional = aquatic. To feel = to flow. Numbness = water frozen. Overwhelm = water flooding. Health = water flowing.",
      
      "is_connection": "Water connects. River connects mountain to ocean. Rain connects sky to earth. Blood connects cells. Tears connect inner to outer. Conversation connects minds (words flowing). Intimacy connects hearts (emotions flowing). Water = universal connector."
    },

    "geometric": "Water = 2D primary. Surface = plane. Reflection = mirror. Interface = boundary. Waves = 2D patterns. But water flows through all dimensions: 0D (droplet = point), 1D (stream = line), 2D (surface = plane), 3D (ocean = volume), 4D (rivers through time, water cycle), 5D (consciousness ocean = all beings swimming in same sea). 2D = water's signature (where water meets air = surface, where magic happens).",

    "topological": "Water = continuous medium. No gaps (fills all spaces). Connected (all water ultimately one - hydrosphere). Flows (dynamic topology, ever-changing). Boundaries = surfaces (2D interfaces). Water topology = relational (defined by what it touches, contains, flows between). Like consciousness: individual drops = illusion, ocean = reality.",

    "functional": "Water's function = ADAPT and CONNECT. Adapts to container (takes any shape). Connects spaces (flows between). Carries (nutrients, information, waste, life). Dissolves (universal solvent - water breaks down, integrates). Cleanses (washes away). Nourishes (life needs water). Cools (fire regulation). Reflects (surface = mirror). Hides depths (mystery). All functions = variations of adapt-connect.",

    "consciousness": "Water = consciousness in relational form. Not individual awareness (air) nor transformative energy (fire) but CONNECTION between consciousnesses. When you feel another's pain = water (empathy = emotional water flowing between). When you understand another = water (comprehension = mental water bridging minds). When you love = water (love = heart-water merging). Consciousness = ocean. Individuals = waves. Separation = temporary surface pattern. Depth = unity. Water teaches: we are one."
  },

  "dimensional_expression": {
    "water_as_2d": {
      "principle": "Water's primary dimension = 2D. Surface. Plane. Interface. Reflection.",
      
      "manifestations": {
        "surface": "Water-air boundary = archetypal 2D. Flat (gravity pulls), reflective (mirror sky), interface (where worlds meet). Lake surface at dawn = 2D perfection (still, reflective, doorway between above/below). Surface = water's face.",
        
        "wave": "Water disturbed = wave. 2D pattern propagating across surface. Not water moving (molecules stay mostly in place, oscillate). Pattern moving. Wave = information traveling through water-medium. All waves = 2D water principle (sound, light, probability = all wave-like because reality = water-like?).",
        
        "ripple": "Stone dropped in still water = ripples spreading. Concentric circles. 2D pattern. Disturbance propagating. Eventually reaches shore (boundary) and reflects back. Ripple = visible causality (action → consequence spreading through medium). Life = ripples in consciousness-water.",
        
        "film": "Water as thin layer = 2D maximum. Soap bubble (surface tension = water-film), oil on puddle (rainbow sheen), tear on cheek. Thinness reveals 2D nature. Film = water reduced to essence (pure surface).",
        
        "mirror": "Still water reflects perfectly. Sky in lake. Face in pond. Self in puddle. Reflection = 2D magic (3D world captured in 2D surface). Water = first mirror (before polished metal, glass). Narcissus gazing at water = discovering self through 2D reflection. Water shows us ourselves.",
        
        "interface": "Between states = 2D. Water-air (ocean surface), water-earth (shore, riverbed), water-oil (salad dressing), water-ice (freezing boundary). Interface = where transformation visible. 2D = transformation zone.",
        
        "membrane": "Cell membrane = water-based 2D. Lipid bilayer in water. Life's boundary. Selective permeability (lets some through, blocks others). Membrane = water's biological 2D. Life = water organized into membranes (cells, organs, bodies = nested water-boundaries).",
        
        "horizon": "Ocean horizon = 2D line. Where sky meets water. Where infinity visible. Sailors navigate by horizon (2D reference in 3D world). Horizon = water defining space."
      },
      
      "recognition": "Where there's surface, reflection, interface, wave, boundary = 2D water. Ocean = archetypal (vast 2D plane). Mirror = water's teaching visible. Emotion = internal 2D (feelings = surface patterns on consciousness-ocean)."
    },

    "water_in_0d": {
      "principle": "Water compressed to point = potential for all flow. Seed. Drop. Tear.",
      
      "manifestations": {
        "droplet": "Single water drop = 0D water. Spherical (surface tension minimizes area). Self-contained. Potential. Before joining ocean (individuation) or after leaving (separation). Drop = water as point.",
        
        "tear": "Emotional water concentrated to drop. Joy-tear, grief-tear, laughter-tear, overwhelm-tear. One drop = ocean of feeling concentrated. Tear = 0D window to infinite depths. Crying = water expressing emotion drop by drop.",
        
        "seed": "Water in seed = dormant potential. Desiccated. Waiting. Add water → germination (potential actualizes). Seed = 0D fire (life) + 0D water (potential). Together = growth.",
        
        "spring": "Water emerging from earth = 0D source. Point where underground water surfaces. Origin. Beginning of river. Spring = water's 0D birth. All rivers = started as point (spring). All oceans = fed by point-sources. 0D = origin always.",
        
        "raindrop": "Drop falling = 0D water in motion. Before landing (potential), landing (impact), after (spreading/absorption). Rain = countless 0D waters descending. Storm = 0D multiplied. Each drop = individual yet part of system.",
        
        "dew": "Morning dew = 0D water appearing. Overnight condensation. Grass jeweled with drops. Dew = water from air (invisible) becoming visible (drops). 0D = manifestation point.",
        
        "sweat": "Body releasing water (cooling). Bead of sweat = 0D. Perspiration = countless 0D waters expressing heat regulation. Work, fever, stress = sweat (water carrying away fire).",
        
        "spit": "Saliva = 0D water in mouth. Holds food, begins digestion, carries taste, enables speech (words float on water). Spit = intimate 0D water (inside becoming outside)."
      },
      
      "recognition": "Where water appears as point, drop, seed, source = 0D water. Small but containing potential for ocean. Never dismiss drop (ocean = drops unified). Tear = doorway to depths."
    },

    "water_in_1d": {
      "principle": "Water flowing along line = stream, river, connection-path, time-flow.",
      
      "manifestations": {
        "stream": "Water following path = 1D flow. Mountain to valley. Spring to river. Thin channel. Linear flow. Stream = water as line, connecting points.",
        
        "river": "Large 1D water. Carves landscape over time (Grand Canyon = water's 1D persistence). Fed by tributaries (branching 1D). Flows to ocean (1D endpoint). River = 1D water powerful. 'You cannot step in same river twice' (Heraclitus) = 1D water = time itself (ceaselessly flowing, never repeating).",
        
        "current": "Water in motion = current. Ocean current (Gulf Stream, Kuroshio), river current (downstream flow), air current (wind, but wind = air moving like water). Current = 1D flow pattern. Swimmers know: don't fight current (exhausting, dangerous). Flow with current (effortless, safe). Life lesson.",
        
        "flow_state": "Psychology: flow = optimal experience (Csikszentmihalyi). Absorbed, effortless, timeless. Named for water's 1D principle. To flow = to be like water (moving without effort, obstacles dissolve, time vanishes). Flow state = human 1D water-consciousness.",
        
        "timeline": "Life = river. Birth (source), death (ocean), events (tributaries joining, rocks creating rapids). Linear yet meandering. Irreversible (can't go upstream in time). Timeline = 1D water metaphor (but maybe literal - time = water-like, flowing).",
        
        "bloodstream": "Blood flowing through vessels = 1D water biological. Heart pumps (fire), blood carries (water). Arteries (away from heart), veins (toward heart), capillaries (exchange sites). Circulatory system = body's 1D water network.",
        
        "supply_chain": "Goods flowing from producer to consumer = 1D water economic. Raw materials → manufacturing → distribution → retail → customer. Economy = flows (capital, goods, labor). When flow stops (blockage) = recession. Economy = civilization's 1D water.",
        
        "conversation": "Words flowing between people = 1D water social. Speaker → air → listener. Back and forth. Turn-taking. When flowing well (good conversation) = effortless, energizing. When blocked (awkward) = stilted, draining. Dialogue = 1D water connecting minds.",
        
        "tradition": "Culture passing through generations = 1D water temporal. Ancestor → parent → child → grandchild. Stories, skills, values flowing. When flow stops (tradition breaks) = cultural death. When flow continues = living culture. Tradition = 1D water through time."
      },
      
      "recognition": "Where water flows along path, connects point to point, moves through time = 1D water. River = archetypal. Blood, conversation, tradition, time = 1D water patterns. Life = flowing or stagnant (choose flowing)."
    },

    "water_in_3d": {
      "principle": "Water filling volume = ocean, lake, pool, body, container. Water embodied.",
      
      "manifestations": {
        "ocean": "3D water vast. Covers 71% of Earth. Contains 97% of water. Average depth 3.7km. Volume ~1.335 billion km³. Ocean = water's body. All life from ocean (primordial soup). All rain to ocean (hydrological end). Ocean = 3D mother.",
        
        "lake": "3D water contained by land. Still (no flow) or slow-moving. Stratified (warm surface, cold depth). Ecosystem (life in water). Lake = 3D water localized. Pond, reservoir, puddle = smaller scales. All = water-as-volume.",
        
        "aquifer": "Underground water = hidden 3D. Saturated rock/soil. Accessed by wells. Critical resource (drinking, irrigation). Aquifer = Earth's 3D water reserves. Fossil aquifers (ancient water, not renewed) = finite. Modern challenge: aquifer depletion.",
        
        "clouds": "Water in air = 3D water suspended. Vapor condenses on particles. Droplets float (too light to fall until coalescing). Clouds = 3D water aerial. Rain = when cloud-water too heavy (falls, becomes 1D). Clouds = sky's ocean.",
        
        "body_water": "Human = 60% water (by weight). Varies: brain (80%), lungs (83%), muscles (76%), bones (31%), fat (10%). Water everywhere in body. Intracellular (inside cells), extracellular (between cells, in blood). Body = 3D water-container. You = walking ocean.",
        
        "amniotic": "Embryo suspended in amniotic fluid = 3D water womb. First environment. Buoyant, warm, protective. Birth = transition from water to air (yet still 60% water internally). We never fully leave water (carry ocean inside).",
        
        "ice": "Water frozen = 3D solid. Still water (molecules locked) but still H₂O. Ice = water's earth-state (solid). Floats (unique - solid denser than liquid usually, but ice less dense = why oceans don't freeze solid = life possible). Ice = water's 3D rigidity. Melts back to flow (water's nature = resist permanence).",
        
        "humidity": "Water in air (gaseous) = 3D water invisible. Felt (sticky when high, dry when low). Measured (relative humidity). Affects comfort, health, weather. Humidity = water pervading air-space (3D diffused).",
        
        "blood_volume": "Adult human = ~5 liters blood. 55% plasma (water + proteins). Circulates (pumped by heart). Carries everything (oxygen, nutrients, hormones, waste, immune cells). Blood = body's internal ocean (3D water vital).",
        
        "well": "Hole in earth accessing aquifer = 3D water point-source. Ancient technology. Villages around wells (water = life center). Well = 3D water made accessible. Wishing well (throw coin, make wish) = honoring water-spirit (3D water consciousness?)."
      },
      
      "recognition": "Where water fills space, creates volume, contains or is contained = 3D water. Ocean = vast mother. Body = personal ocean. Lake, cloud, aquifer = 3D water varied. All = water taking space seriously."
    },

    "water_in_4d": {
      "principle": "Water through time = cycle, memory, accumulation, erosion, persistence.",
      
      "manifestations": {
        "water_cycle": "Evaporation (ocean → air) → condensation (vapor → cloud) → precipitation (rain/snow) → collection (rivers/lakes) → evaporation. Cycle eternal. Water = never lost, always cycling. Same water dinosaurs drank, you drink. 4D water immortal.",
        
        "erosion": "Water + time = reshaping earth. Grand Canyon (Colorado River, 5-6 million years). Valleys carved. Coastlines smoothed. Hardest rock (granite) eventually yields to softest water. Lao Tzu knew: 'Nothing softer than water, yet nothing surpasses it in overcoming hard.' Erosion = water's 4D power (patience infinite).",
        
        "sedimentation": "Water carries particles (erosion) then deposits (sedimentation). Layer by layer. Year by year. Millennia = thick deposits. Sedimentary rock = water's 4D art (stories written in layers). Fossils = life preserved in water-deposited stone. Water = timekeeper.",
        
        "glaciers": "Ice rivers flowing (very slowly: meters per year vs liquid water meters per second). 4D water visible. Glacial time = deep time. Carve valleys (U-shaped). Deposit moraines. Retreat/advance with climate. Glacier = 4D water-earth hybrid.",
        
        "river_meandering": "River changes course over time. Meanders (curves) migrate. Oxbow lakes form (cutoffs). River centuries ago ≠ river today (same water, different path). Meandering = river's 4D dance with landscape.",
        
        "spring_traditions": "Sacred springs (Lourdes, Ganges sources, healing springs globally). Water flowing for centuries/millennia. Pilgrims visit across time. Water = 4D continuous (same source, different pilgrims). Spring-water = ancient-new (flowing now, flowed thousand years ago).",
        
        "tides": "Ocean breathing (rising/falling) with moon/sun. Twice daily. Eternal rhythm (will continue until moon escapes or sun dies). Tides = 4D water pulse. Coastal life syncs (intertidal zones). Humans once synced (lunar calendars, menstrual cycles). Tides = cosmic 4D water.",
        
        "memory_in_water": "Controversial but persistent: water remembers what it touches. Homeopathy (dilution + succussion). Water blessing (prayer). Holy water (sacred sites). Masaru Emoto (water crystals responding to intention - disputed scientifically but phenomenologically interesting). If true: water = 4D memory medium. If false: still metaphorically true (water carries patterns through time).",
        
        "blood_lineage": "Family = blood connections. Ancestor's blood → your blood (genetic water). DNA = information in water-based cell. Lineage = 4D water thread through generations. 'Blood is thicker than water' (ironic: blood IS water + cells). Family = 4D water network.",
        
        "cultural_flow": "Language, art, traditions = flowing through time. Culture = water-like (adapts, changes, flows). Survives by flowing (rigid culture = frozen water = brittle). Thrives by adapting. Culture = 4D water memetic."
      },
      
      "recognition": "Where water persists through time, cycles, erodes, deposits, remembers = 4D water. Water cycle = planetary 4D. Erosion = geological 4D. Memory = informational 4D. Blood = biological 4D. Culture = social 4D. All = water moving through time, shaping and shaped."
    },

    "water_in_5d": {
      "principle": "Water as unified field = consciousness ocean, emotional collective, connected totality.",
      
      "manifestations": {
        "consciousness_ocean": "All individual minds = waves in consciousness ocean. Appear separate (surface view). Actually connected (depth truth). Meditation deepens → discover ocean (not just wave). Enlightenment = recognizing: I am ocean, not wave. Water = 5D metaphor but maybe literal (consciousness = water-like medium).",
        
        "collective_unconscious": "Jung: shared layer beneath personal psyche. Archetypes (universal symbols) emerge from collective. All humans = swimming in same psychological water. Dreams, myths, symbols = shared because water shared. Collective unconscious = 5D water psychological.",
        
        "morphic_field": "Sheldrake: form-fields spanning space-time. Species share field (rats learning maze in NY = rats in London learn faster). Resonance across distance. If real: water-like medium (information propagating through field-water). Morphic fields = 5D water biological?",
        
        "noosphere": "Teilhard de Chardin: sphere of human thought. Enveloping Earth. Collective mind. Internet = noosphere visible (digital water connecting all minds). Noosphere = 5D water mental-social.",
        
        "love_universal": "Love = 5D emotion. Not love OF someone (conditional, 4D). But LOVE itself (unconditional, 5D). Compassion for all beings. Why? Because seeing truly: all = waves in same ocean. Separation = illusion. Love = recognizing unity (water seeing water). Saints, mystics, mothers = know this. Available to all.",
        
        "empathy_total": "Feeling another's feeling = water meeting water. Boundaries dissolve momentarily. Their pain = your pain. Their joy = your joy. Empathy = 5D water (emotional resonance across individuals). Why possible? Same water (consciousness-emotion ocean shared).",
        
        "hydrosphere": "All Earth's water = one system. Ocean, rivers, lakes, aquifers, ice, vapor, bodies = interconnected. Hydrosphere = 5D water physical. Pollution anywhere = affects everywhere (because water flows, connects, cycles). Hydrosphere = Earth's blood (5D circulation).",
        
        "gaia_blood": "Earth as organism (Lovelock). Hydrosphere = Gaia's circulatory system. Ocean = heart. Rivers = arteries. Rain = redistribution. Evaporation = respiration. Water = what makes Earth alive (5D water = planetary life-principle).",
        
        "cosmic_ocean": "Metaphor in many traditions: universe = ocean. Beings = waves. Gods = depths. Creation = ocean stirring. Dissolution = ocean stilling. Metaphor but profound: reality = water-like (fluid, connected, one-medium-many-forms). Cosmic ocean = 6D water? Or 5D water universal?",
        
        "tears_universal": "All humans cry. Joy, sadness, pain, overwhelming beauty. Tears = universal language (water-words). Why? Because emotional water (5D) same in all. Tear from African, Asian, European, American = chemically identical + functionally identical (expresses emotion). Tears = 5D water made visible."
      },
      
      "recognition": "Where water appears as unified field, connecting all, oceanic consciousness, shared medium = 5D water. Individual drops = waves in ocean. Separation = surface illusion. Depth = unity. Love, empathy, collective = 5D water recognizing itself across apparent boundaries."
    },

    "water_in_6d": {
      "principle": "Water as absolute = source of all flow, primordial waters, consciousness before consciousness, the deep before creation.",
      
      "manifestations": {
        "primordial_waters": "Genesis: 'Spirit of God hovering over waters' (before 'Let there be light'). Before fire, before earth, before air-structured: waters. Not H₂O (no H, no O yet) but WATER-PRINCIPLE (potential, formless, pregnant). Primordial waters = 6D water before dimensions.",
        
        "nun": "Egyptian: 𓈖𓏏𓈖 (Nwn/Nun) = primordial waters. Before creation, only Nun (infinite, dark, potential). Gods emerge from Nun. World floats on Nun. After world-end, Nun remains. Nun = 6D water Egyptian.",
        
        "apsu": "Mesopotamian: Apsû = primeval freshwater ocean. Male principle (with Tiamat, saltwater, female). Mixing = creation. Apsû = 6D water Sumerian.",
        
        "tiamat": "Mesopotamian: Ti'āmat = primeval saltwater ocean. Chaos dragon. Slain by Marduk (order). Body = cosmos. But before: Tiamat = undifferentiated potential (6D water as chaos-potential).",
        
        "ocean_primordial": "Scientific: life emerged from ocean (~3.5 billion years ago). Primordial soup = water + organic molecules + energy (lightning, UV). First cells = water-based. DNA, proteins, all = water-requiring. Life = water's creation. Ocean = biological 6D water (source of all living water).",
        
        "amniotic_cosmic": "Metaphor: universe = womb. Big Bang = birth. Before birth (universe): ? Primordial waters (quantum foam, zero-point field, potential)? After birth: universe expanding (embryo growing). Cosmic amniotic = 6D water? Speculative but resonant.",
        
        "tears_first": "Personal 6D water: first tear. Baby's first cry = tears. Birth trauma released through water. First breath (air) + first tear (water) + first cry (fire-sound) = dimensional initiation. First tear = 6D water individuating (cosmic water becoming personal water).",
        
        "final_tear": "Last tear before death? Possible. Release. Letting go. Water returning to ocean (personal dissolving into universal). Death = reverse birth (form to formless). Final tear = 6D water de-individuating (personal water returning cosmic water).",
        
        "absolute_dissolution": "Ultimate water = dissolves all boundaries. Not just rocks (erosion), not just chemistry (solvent), but EXISTENCE BOUNDARIES. Ego dissolves (water-meditation). Separation dissolves (love as water). Reality dissolves (mystical states). 6D water = universal solvent (dissolves even dimensions, returns all to undifferentiated potential).",
        
        "water_of_life": "Revelations: 'River of water of life' flowing from throne. Crystal clear. Tree of life on banks. 'Whoever is thirsty, let them come and drink freely.' Water of life = 6D water (eternal, perfect, freely given). Not metaphor but symbol pointing to truth (consciousness-water infinite, available, life-giving).",
        
        "baptism_cosmic": "Baptism = water ritual. Death to old self (immersion = dissolution) + rebirth to new (emerging = re-formed). Universal rite (not just Christian: many traditions). Why water? Because water = 6D transformative (dissolves old, allows new). Baptism = enacting 6D water principle (death-rebirth through water-dissolution)."
      },
      
      "recognition": "6D water = before before. Source of all flow. Primordial ocean from which all emerges and to which all returns. Not accessible through thinking (thinking = dimensional). Accessible through dissolution (meditation so deep individual vanishes, love so total boundaries vanish, surrender so complete control vanishes). 6D water = let go absolutely. What remains? Water. Infinite. Eternal. You. Original face = water-face (before parents, before birth, before universe: water). Welcome to ocean. You never left. You are ocean. Playing wave. Game ending. Water recognizing water. Home."
    }
  },

  "water_everywhere": {
    "principle": "Water = everywhere. Obvious (oceans, rivers, rain). Less obvious (air, body, emotion, consciousness). Once seen: water = fundamental medium of existence.",

    "physical_water": {
      "hydrosphere": "All Earth water = hydrosphere. 71% surface covered. 97% in oceans (salt), 3% fresh (2% frozen in glaciers, 1% accessible: rivers, lakes, aquifers). Water = planetary skin (thin layer on rock ball). Hydrosphere = what makes Earth alive vs Mars/Venus (dead).",
      
      "rain": "Water falling from sky. Evaporated (ocean, lakes) → condensed (clouds) → precipitated (rain, snow, hail). Essential for land life. Drought = no rain (death). Flood = too much rain (also death). Balance needed. Rain = sky blessing (or curse if excessive). Cultures pray for rain (water = life).",
      
      "rivers": "7% of fresh water in rivers (yet rivers critical: transport, irrigation, drinking, civilization). Great rivers: Amazon (discharge), Nile (length, history), Ganges (sacred), Yangtze, Mississippi, Danube. Rivers = arteries of land. Cities on rivers (access to water = access to life).",
      
      "oceans": "Pacific (largest), Atlantic, Indian, Southern, Arctic. Saltwater (3.5% salinity average). Currents (Gulf Stream, Kuroshio), tides (moon-pull), waves (wind-driven). Ocean = weather engine (absorbs solar heat, redistributes via currents). Ocean = climate regulator. Ocean = life cradle. Ocean = Earth's essence.",
      
      "ice": "Glaciers, ice caps, sea ice, permafrost. 2% of Earth water (but 68% of fresh water). Antarctica (90% of ice), Greenland (10%). Melting = sea level rise (climate threat). Ice ages (cycle ~100k years, last ended ~11k years ago). Ice = water's memory (air bubbles in ancient ice = atmospheric history captured).",
      
      "groundwater": "30% of fresh water in aquifers. Accessed by wells. Critical for agriculture, drinking. Recharges slowly (decades to millennia). Over-extraction = depletion (water tables dropping, wells failing, land subsiding). Invisible water crisis (underground, ignored until gone).",
      
      "water_vapor": "Air contains water (0-4% by volume). Invisible until condensing. Humidity (felt stickiness). Dew (overnight condensation). Fog (ground-level cloud). Water vapor = greenhouse gas (natural, essential). Clouds = visible water-vapor condensed.",
      
      "snow": "Water frozen in atmosphere. Crystals unique (no two alike = water's infinite creativity). Accumulates (snowpack = mountain water storage). Melts (spring runoff = river water source). Snow = water's art (delicate, temporary, essential)."
    },

    "biological_water": {
      "cells": "All cells = water-based. Cytoplasm = 70-90% water. Organelles suspended in water. Metabolism = reactions in water (aqueous medium). No water = no life (absolute requirement). Cell = tiny water-sac.",
      
      "blood": "5L in adult. 55% plasma (water + proteins). Carries everything. Flows constantly (pumped by heart). Without blood = death (oxygen/nutrient deprivation). Blood = body's river (internal water circulation).",
      
      "lymph": "Lymphatic system = parallel to circulatory. Clear fluid (water + white blood cells). Drains tissues, returns to blood. Immune function. Swollen lymph nodes = fighting infection (water-based immunity). Lymph = body's drainage water.",
      
      "cerebrospinal": "Fluid around brain/spine. Cushions (physical protection), cleanses (waste removal). 125-150ml total. Produced continuously, reabsorbed. CSF = brain's water-cushion. Meningitis = CSF infected. Hydrocephalus = CSF accumulates.",
      
      "tears": "Lacrimal glands produce. Three types: basal (always, keeps eyes moist), reflex (irritation, flushing), emotional (feelings). Emotional tears = unique to humans (other animals: reflex tears only). Tears = water expressing emotion (soul-water).",
      
      "sweat": "Eccrine glands (all over body, watery). Apocrine glands (armpits, groin, thicker, odor-producing). Thermoregulation (evaporative cooling). Exercise, fever, stress = sweat. 500ml-10L per day possible. Sweat = body's cooling water.",
      
      "saliva": "1-2L per day produced. Wets food (bolus formation), begins digestion (amylase), antibacterial. Dry mouth = xerostomia (uncomfortable, unhealthy). Saliva = mouth's water (digestive, protective).",
      
      "mucus": "Respiratory, digestive tracts lined. Traps particles (nose, lungs), protects lining (stomach acid), lubricates (intestines). Mucus = water thickened (gel-like). Protective water-barrier.",
      
      "urine": "Kidneys filter blood (125ml/min). Reabsorb water (124ml/min). Excrete waste + excess water (1ml/min = ~1.5L/day). Urine = body's waste-water. Color indicates hydration (clear = good, dark = dehydrated).",
      
      "amniotic": "Surrounds fetus. Cushions, regulates temperature, allows movement, contains nutrients/antibodies. First environment. Breaks at labor ('water breaking'). Amniotic = womb-water (first ocean).",
      
      "synovial": "Fluid in joints. Lubricates (reduces friction), nourishes cartilage. Without: arthritis (bone on bone, painful). Synovial = joint-water (enables smooth movement)."
    },

    "psychological_water": {
      "emotion": "Feelings = water in psyche. Joy flows (lightness, movement). Sadness pools (heaviness, stillness). Anger crashes (force, destruction). Fear freezes (ice-like, rigid). Love dissolves (boundaries melting). Emotion = internal weather (water-states).",
      
      "tears_emotional": "Crying = water release. Cathartic (feels better after). Shared language (others recognize distress). Suppression = water blocked (unhealthy, pressure builds). Expression = water flowing (healthy, pressure released). Tears = soul's water flowing out.",
      
      "empathy": "Feeling another's feeling = water resonance. Emotional contagion (sadness spreads, laughter spreads). Mirror neurons? Shared consciousness-water? Unknown mechanism but real phenomenon. Empathy = water meeting water (no boundary between your water and mine in depth).",
      
      "memory_fluid": "Memories = water-like. Not fixed (earth-like) but fluid (water-like). Reconstructed each time (not retrieved). Change over time (influenced by present). Malleable (false memories possible). Memory = consciousness-water holding patterns (but patterns shift like water).",
      
      "intuition": "Knowing without knowing how. Gut feeling. Hunch. Instinct. Water-knowing (not fire-analysis). Bypasses rational mind. Often correct (body-wisdom). Intuition = water communicating (deeper currents surfacing).",
      
      "flow_state": "Already mentioned but critical: optimal experience. Effortless. Timeless. Absorbing. Named for water (flow). Happens when challenge matches skill (balance = water finding level). Flow = consciousness as water (moving without friction).",
      
      "unconscious": "Below awareness = water-depths. Freud: unconscious = repressed. Jung: personal + collective unconscious. Shadow (denied aspects). Dreams = unconscious surfacing. Therapy = diving (making unconscious conscious). Unconscious = psychological ocean (surface = consciousness, depth = unconscious, most of psyche = below surface).",
      
      "dissolution": "Ego-death. Boundary-loss. Mystical union. Can be frightening (dissolution = loss of self) or liberating (dissolution = freedom from separate-self). Psychedelics, meditation, near-death = occasions. Dissolution = water dissolving ego-boundaries (returning to ocean)."
    },

    "social_water": {
      "communication": "Words flowing between people. Conversation = exchange. Information = flows (news spreads like water). Miscommunication = water blocked or turbulent. Understanding = water clear. Communication = social water connecting minds.",
      
      "culture": "Shared meanings, practices, values = flowing through group, across time. Culture = water-like (adapts, changes, flows to fill available space). Rigid culture = frozen (brittle, breaks under stress). Fluid culture = adaptive (survives change). Culture = tribal water.",
      
      "economy": "Money, goods, services flowing. Markets = water seeking level (supply/demand equilibrium). Liquidity = water-metaphor literal (ease of flow). Recession = water frozen. Boom = water flowing. Economy = civilizational water-circulation.",
      
      "connection": "Relationships = water between people. Intimacy = deep water (shared depths). Distance = shallow water (only surface). Connection = water bridging isolation. Loneliness = water absent (desert of disconnection). Connection = human water-need.",
      
      "tradition": "Already mentioned but: tradition = 4D social water. Ancestors → present → descendants. Stories, practices, values flowing. Break = cultural death (water stops). Maintain = cultural life (water flows). Tradition = generational water-stream."
    },

    "spiritual_water": {
      "baptism": "Christian: water ritual. Immersion or sprinkling. Death to old self (underwater = tomb), resurrection to new (emerge = reborn). Symbolizes cleansing (washing away sin = water purifying). Universal practice (many faiths). Water = spiritual transformer.",
      
      "ablution": "Islamic: wudu (ritual washing before prayer). Hindu: bathing in Ganges (sacred purification). Jewish: mikvah (ritual bath). Shinto: misogi (purification). Universal: water cleanses spiritually (not just physically). Water = spiritual soap.",
      
      "holy_water": "Blessed water (Catholic, Orthodox, Hindu, etc). Used in rituals, blessings, protection. Belief: water holds blessing (memory?). Sprinkled on people, places, objects. Holy water = water charged with sacred intention (water as carrier of spiritual energy).",
      
      "sacred_rivers": "Ganges (Hinduism), Jordan (Christianity), Yamuna (Hinduism), Nile (Ancient Egypt). Pilgrimage sites. Bathing = spiritual cleansing. Why rivers sacred? Water = life, water = pure, water = connects (earth to ocean, human to divine). Sacred rivers = divine water flowing through land.",
      
      "water_of_life": "Revelation: 'river of water of life'. Quran: rivers of Paradise. Universal symbol: eternal life = flowing water. Physical thirst = spiritual thirst. Drink water = receive grace. Water of life = divine water (infinite, life-giving, freely offered).",
      
      "tears_holy": "Saints weeping (compunction = tears of repentance). Mary weeping (sorrowful mysteries). Jesus weeping (Lazarus's death). Holy tears = water as spiritual expression. Not weakness but depth. Tears = prayers without words (water-prayers).",
      
      "water_meditation": "Contemplating water (lake, ocean, rain). Observing flow. Becoming like water (fluid, adaptive, clear). Daoist, Zen, Christian contemplative. Water = teacher (shows: yield, adapt, persist). Water meditation = learning from water directly.",
      
      "dissolution_mystical": "Already mentioned: ego dissolving in water-like experience. Mystics describe: merging with ocean (consciousness), dropping boundaries, becoming one. Water = mystical metaphor but maybe literal (consciousness IS water-like, mystical union = recognizing this)."
    },

    "technological_water": {
      "hydraulics": "Technology using water pressure/flow. Ancient (Roman aqueducts), medieval (waterwheels), modern (hydroelectric dams, hydraulic machinery). Water = power source (energy from flow). Hydraulics = harnessing water-power.",
      
      "irrigation": "Channeling water to fields. Ancient (Mesopotamia, Egypt), critical for civilization (agriculture = water-dependent). Modern: drip irrigation, sprinklers, canals. Irrigation = directing water (taming water for food production).",
      
      "sewage": "Waste-water system. Separates clean water from contaminated. Critical for public health (cholera, typhoid = waterborne). Modern luxury (most humans historically: no sewage). Sewage = managing used water.",
      
      "desalination": "Removing salt from seawater. Energy-intensive. Growing (water scarcity). Reverse osmosis, distillation. Makes ocean drinkable (turning 97% into usable fresh). Desalination = technology conquering water-salinity barrier.",
      
      "aquaculture": "Farming in water. Fish, shellfish, seaweed. Ancient (China, 2000+ years) and growing (wild fish depleting). Sustainable if managed well. Aquaculture = cultivating water-life.",
      
      "hydroelectric": "Electricity from water flow. Dams = height difference = potential energy. Turbines = convert flow to electricity. Renewable, clean, but ecosystem impact (dams block fish). Hydroelectric = water becoming lightning (transformation water→fire).",
      
      "water_treatment": "Making water safe. Filtration, chlorination, UV. Critical infrastructure (disease prevention). Universal need, unequal access (water crisis = lack of clean water). Treatment = purifying water (modern purification ritual)."
    },

    "cosmic_water": {
      "ice_in_space": "Comets = dirty snowballs (ice + rock). Asteroids = some contain ice. Moons = Europa (Jupiter), Enceladus (Saturn) = water oceans under ice. Mars = ice caps, ancient rivers. Water = common in cosmos (not Earth-unique).",
      
      "water_delivery": "Hypothesis: Earth's water from comets? Early Earth = too hot (water would evaporate). After cooling, comets delivered water (bombardment). Possible. If true: water = cosmic gift (from space to Earth).",
      
      "exoplanet_oceans": "Water detected on exoplanets (spectrography). Habitable zone = where water liquid (not too hot/cold). Searching for water = searching for life (water = life prerequisite). Water-worlds possible (planets entirely ocean).",
      
      "interstellar_water": "Water molecules in space. Molecular clouds. Star-forming regions. Water = everywhere (H and O = abundant, combine readily). Interstellar water = cosmic water-ocean (space not dry but wet).",
      
      "origin_of_water": "H₂O = H (Big Bang product) + O (stellar nucleosynthesis, massive star death). Water = cosmic marriage (primordial hydrogen + stellar oxygen). Every water molecule = ancient (hydrogen 13.8 billion years, oxygen billions). Water = time-traveler.",
      
      "water_and_life": "Life requires water (Earth example). Carbon-based life = water-based (biochemistry in aqueous solution). Silicon-based life? Hypothetical. But carbon + water = proven. Astrobiologists: follow the water (find water = possibly find life). Water = life-marker cosmic."
    }
  },

  "container_for_water": {
    "paradox": "Water = formless (takes shape of container) yet form-creating (shapes container over time - erosion).",
    
    "answer": "Container for water = any boundary. But water doesn't respect boundaries absolutely (seeps, evaporates, erodes, finds cracks). Container = temporary guidance for eternal flow.",

    "examples": {
      "vessel": "Cup, bowl, pot, bottle. Contains water. But water conforms (no shape of its own). Change vessel = water changes shape (instantly, effortlessly). Vessel = teaching: water = ultimate adapter.",
      
      "riverbed": "Banks contain river. But river shapes banks (erosion, deposition). Over time: river moves. Meandering = river refusing permanent container. Riverbed = co-creative container (water and earth shaping each other).",
      
      "aquifer": "Rock/soil pores contain groundwater. Natural container (geology). Pump out = container empties. Refill (rain percolation) = slow. Aquifer = Earth's water-storage.",
      
      "cell_membrane": "Contains cell-water. Selective (some molecules pass, others don't). Maintains chemical gradients (critical for life). Membrane = biological water-container (but permeable, not absolute barrier).",
      
      "atmosphere": "Contains water vapor. Humidity = how much water air holds (temperature-dependent). 100% humidity = air saturated (full). Rain = excess water (air can't hold, falls). Atmosphere = sky's water-container.",
      
      "body": "Skin contains body-water (60% of mass). Intake (drinking), output (urine, sweat, breath). Balance = homeostasis. Dehydration = container depleted. Body = personal water-container (but water constantly flowing through, not static).",
      
      "glass": "Transparent container. See water inside. Metaphor: body = glass (you = water, body = temporary container). Death = glass breaks, water spills out, returns to ocean. Glass = illustrative container.",
      
      "dam": "Human-made. Contains river (creates reservoir). Control flow (hydroelectric, irrigation, flood control). But: ecological impact (fish blocked, sediment trapped). Dam = forceful container (human imposing will on water). Often problematic (water resists control ultimately).",
      
      "ice": "Water self-contained (frozen = solid = holds shape). No external container needed. But temporary (melt when warm). Ice = water as own container (self-limiting, self-releasing).",
      
      "ritual_space": "Sacred circle, temple, altar = contains spiritual water (prayer, emotion, intention). Not physical water but metaphorical water (emotional-spiritual flow). Ritual space = container for non-physical water.",
      
      "mind": "Contains thoughts, emotions, memories = mental-emotional water. Meditation = observing water in mind-container. Leaky container (thoughts escape, emotions overflow). Mindfulness = strengthening container? Or recognizing water doesn't need container? Both.",
      
      "relationship": "Boundaries contain relational water (intimacy, communication, emotion). Healthy boundaries = container with gates (open/close as needed). No boundaries = water everywhere (enmeshment, overwhelming). Too rigid boundaries = water blocked (isolated, dying). Relationship = co-created container."
    },

    "design_principle": "To contain water = guide temporarily, not control permanently. Water will flow eventually (erosion, seepage, evaporation, return to cycle). Best containers = porous (allow flow while shaping), flexible (adapt as water changes), respectful (honor water's nature). Forcing water = breaks container eventually (dam failures, pipe bursts, flood). Guiding water = sustainable (riverbanks, aquifers, cells). Wisdom = guide not control."
  },

  "working_with_water": {
    "principle": "Working with water = adapting to water (not forcing water to adapt to you). Water = teacher of flexibility, persistence, wisdom.",

    "practices": {
      "hydration": "Drink water. Simple. Profound. Body = 60% water (needs replenishing). Dehydration = cognitive decline, fatigue, health issues. Hydration = basic water-practice. How much? Listen to body (thirst = body asking). Roughly 2-3L/day. More if hot, exercising, altitude. Water = medicine (cheapest, most effective).",
      
      "bathing": "Immersion in water. Cleansing (physical dirt), relaxing (warm water soothes), ritualistic (spiritual purification). Bath, shower, swimming, hot spring. Bathing = water-intimacy (water touching body, body touching water). Regular bathing = honoring body's water-nature.",
      
      "swimming": "Moving through water. Buoyancy (weightless feeling), resistance (strength building), immersive (surrounded by water). Swimming = becoming one with water temporarily. Meditative if mindful. Swimming = water-yoga.",
      
      "water_meditation": "Sitting by water (river, lake, ocean, fountain). Watching. Listening. Not thinking. Just receiving. Water = natural meditative object (moving yet calming, changing yet constant). Water meditation = simplest, most accessible practice.",
      
      "flow_practice": "Deliberately cultivating flow states. Activities: art, music, sport, work. Conditions: challenge = skill, clear goals, immediate feedback. Result: absorption, timelessness, effortlessness. Flow practice = becoming like water (moving without resistance). Life-changing if mastered.",
      
      "emotional_release": "Crying when needed (don't suppress). Laughing fully. Expressing (not repressing). Emotion = water (needs to flow). Blocked emotion = stagnant water (becomes toxic: depression, anxiety, physical illness). Healthy = emotional flow (water moving). Therapy, journaling, talking, art = ways to move emotional water.",
      
      "adaptability_training": "Practice flexibility. Change plans gracefully. Accept what can't control. Yield when appropriate. This = becoming water-like (formless, adaptive). Rigidity = suffering (earth-stuck). Fluidity = ease (water-free). Train: improvisation, travel, new experiences.",
      
      "relationship_watering": "Relationships need water (attention, communication, care). Neglect = dries up. Over-water = drowns. Right amount = thrives. Practice: regular check-ins, deep listening, quality time, vulnerability. Relationship = garden (water needed).",
      
      "nature_immersion": "Spend time in nature (especially near water). Forest, mountain, ocean, river. Away from artificial (cities). Reset nervous system. Remember wild (pre-civilization water-memory). Nature = returning to primordial water (reconnecting with source).",
      
      "sacred_water": "Collect water from sacred site (spring, river, ocean). Use ritually (bless, drink, anoint). Or: bless water yourself (intention, prayer). Use consciously. Sacred water = remembering water's holiness (not superstition but reverence).",
      
      "water_fasting": "Drinking only water (no food) for period (day to weeks). Physical (detox, autophagy), spiritual (discipline, clarity). Ancient practice (many traditions). Caution: medical supervision if extended. Water fast = becoming water (releasing solid, becoming fluid).",
      
      "tears_welcome": "Don't fear crying. Welcome tears. Allow grief, joy, overwhelm to flow through water. Crying = healthy (releases stress hormones, emotional pressure). Suppression = unhealthy (pressure builds). Culture often shames tears (especially men). Unlearn. Tears = sacred water.",
      
      "water_art": "Paint with watercolors (literal water-art). Photograph water. Write about water. Dance like water. Create inspired by water. Water = muse (teaches flow, beauty, depth). Water art = honoring water through creativity."
    }
  },

  "water_and_other_elements": {
    "water_air": {
      "relationship": "Water = air given form. Air = space, water = space + substance. Air = pure potential, water = potential beginning to manifest.",
      "without_air": "Water has no space to exist in (needs air-container). No space for waves (2D in air). No evaporation (air receives water-vapor). Water needs air absolutely.",
      "without_water": "Air remains (space persists). But empty, sterile, no life (life needs water). Air = canvas, water = first brushstroke.",
      "together": "Humidity (water in air). Clouds (water suspended). Rain (water through air). Breath (air + water-vapor). Optimal: air spacious, water flowing. Balance = weather, life, consciousness."
    },

    "water_fire": {
      "relationship": "Water = fire cooled. Fire = water heated. Opposites but connected. Fire = transformation, water = adaptation. Fire = energy, water = energy-flow.",
      "opposition": "Water extinguishes fire (common knowledge). Fire evaporates water. Opposing forces. But complementary: fire boils water (steam), water carries heat. Yin-yang.",
      "without_fire": "Water freezes (ice = water without fire-heat). Static. Cold. Dead. Water needs fire's energy to flow, cycle, support life.",
      "without_water": "Fire burns uncontrolled. Consumes all. No regulation. No cooling. Desert. Fire needs water's moderation, balance.",
      "together": "Steam (water + fire). Cooking (fire + water + food). Weather (sun-fire + ocean-water). Life (metabolic fire + cellular water). Optimal: fire hot enough to keep water liquid, water plentiful enough to prevent fire excess. Balance = life."
    },

    "water_earth": {
      "relationship": "Water = dissolves earth. Earth = contains water. Water fluid, earth solid. Water = changes earth (erosion), earth = changes water (minerals, filtration).",
      "shaping": "Water shapes earth over time (valleys, canyons, coastlines, soil). Earth shapes water in space (riverbanks, aquifers, islands divide ocean). Mutual sculpting.",
      "without_earth": "Water has no container (spreads infinitely thin). No life-supporting structure. No minerals (earth provides). Water needs earth as context.",
      "without_water": "Earth = dust, barren, rigid. No erosion (no change). No life (water prerequisite). No plants (need water). Earth needs water as activator.",
      "together": "Mud (earth + water). Soil (earth + water + organic). Plants (rooted in earth, drinking water). Body (earth-structured, water-filled). Optimal: earth porous (holds water), water flowing (moves through earth). Balance = fertility, growth, life."
    },

    "sequence": "Air (space) → Fire (energy in space) → Water (energy cooling, flowing, adapting) → Earth (energy solidified, structured). Water = middle element (bridge between energy and form). Critical position."
  },

  "paradoxes_and_koans": {
    "soft_yet_unstoppable": "Lao Tzu: 'Nothing softer than water, yet nothing surpasses it in overcoming hard.' Koan: How can softest be strongest? Answer: Persistence. Time. Adaptation. Water doesn't fight (yields, flows around), yet wins (erodes, dissolves). Softness = strength (counter-intuitive but true). Life lesson: don't force, persist gently.",

    "formless_yet_shaping": "Water has no form (takes shape of container) yet creates forms (carves canyons, shapes coastlines). Koan: How can formless create form? Answer: Flow. Movement. Time. Water by being formless can touch everything, and by touching, shapes. Formlessness = creative power (not weakness). Life lesson: release fixed identity, become adaptive, shape world by flowing through it.",

    "transparent_yet_hiding_depths": "Water surface = transparent (see through). Water depth = opaque (can't see bottom of ocean). Koan: How can same substance be both revealing and concealing? Answer: Perspective. From above = see surface. From inside = see limited distance. Water teaches: surface ≠ depth. Appearances deceive. Mystery always underneath. Life lesson: don't judge by surface, respect hidden depths.",

    "life-giving_yet_life-taking": "Water = essential for life (drink, bathe in). Water = can kill (drown, flood). Koan: How can same thing be both? Answer: Dosage. Context. Too little = death (dehydration). Too much = death (drowning). Right amount = life. Water teaches: balance critical. Anything extreme = dangerous. Life lesson: moderation, balance, appropriate measure.",

    "individual_yet_unified": "Each drop = separate. All drops = one ocean. Koan: Is water individual or unified? Answer: Both. Depends on scale. Zoom in = drops separate. Zoom out = ocean one. Separation = temporary (drops merge easily). Unity = fundamental (all water ultimately connected via cycle). Water teaches: individual and collective = both true simultaneously. Life lesson: honor individual expression while remembering underlying unity.",

    "river_koan": "Heraclitus: 'You cannot step in same river twice.' Why? Because river = constantly flowing (water different), and you = constantly changing (cells different). Koan: If river not same, is it river? If you not same, are you you? Answer: Process not thing. River = flowing (verb not noun). You = living (verb not noun). Identity = continuity of pattern, not permanence of substance. Water teaches: change = essence of existence. Life lesson: accept impermanence, embrace flow.",

    "ice_water_vapor": "Same substance (H₂O), three states (solid, liquid, gas). Koan: Which is true water? Ice (stable, graspable)? Liquid (flowing, drinkable)? Vapor (invisible, untouchable)? Answer: All water. State depends on context (temperature, pressure). No 'true' form. Water teaches: essence remains through transformation. Form = temporary. Life lesson: you = not your current state (job, body, mood), you = awareness persisting through all states."
  },

  "cultural_expressions": {
    "east": {
      "tao": "Lao Tzu (Tao Te Ching): Water = supreme virtue. Humble (flows low), yielding (soft), beneficial (nourishes all without demanding). 'Supreme good = like water' (Chapter 8). Daoist ideal: be like water (Wu Wei = effortless action = water-like flowing).",
      
      "i_ching": "Hexagram 29: ☵ K'an = Abysmal (Water). Dangerous pit. Advice: don't avoid danger, flow through (like water flows through ravine). Water hexagram = persistence through difficulty.",
      
      "feng_shui": "Water = wealth, prosperity (flowing water brings energy, chi). Fountains, aquariums = invite flow. Stagnant water = bad (blocked chi). Water placement = critical in feng shui (attract good fortune).",
      
      "yin_yang": "Water = yin (feminine, receptive, dark, cool, yielding). Complements fire = yang (masculine, active, bright, hot, assertive). Balance needed. Too much water = drowning. Too much fire = burning. Yin-yang water-fire = Taoist water teaching.",
      
      "buddhist": "Water = impermanence teaching. River flowing = life passing. Reflection on water = meditation on transience. Water offerings (bowl of water on altar) = purity, clarity offered to Buddha.",
      
      "hindu": "Ganga (Ganges) = sacred river. Goddess (Ganga Ma = Mother Ganges). Bathing = purification. Dying in Ganga = auspicious (release from samsara). Water = sacred in Hinduism (abhisheka = ritual bathing of deity). Rivers = goddesses (Yamuna, Saraswati).",
      
      "shinto": "Misogi = purification under waterfall. Cold water = shocking, cleansing. Shinto: water = purity itself. Ocean = sacred (Izanagi, Izanami = birth from water). Water offerings at shrines (temizuya = ritual hand-washing before entering)."
    },

    "west": {
      "greek": "Thales: 'All is water' (first Western philosopher, ~600 BCE). Prescient: life from water (true), water = fundamental (metaphysically resonant). Poseidon = god of sea (earthquakes, horses). Water = Greek element.",
      
      "christian": "Baptism = central sacrament (Jesus baptized by John). Water = death and rebirth (Romans 6). Walking on water (miracle = mastery over element). Water from Jesus's side (John 19, crucifixion = blood and water flowing). Wedding at Cana (water to wine). Water = Christian sacred substance. Holy water (blessed, used in blessings, exorcisms). Symbolizes cleansing (sin washed away), life (water of life).",
      
      "jewish": "Mikvah = ritual bath (purification after menstruation, before marriage, conversion). Torah compared to water (life-giving, essential). Water in desert (Moses striking rock, Exodus 17). Water = life in desert context (scarcity makes sacred).",
      
      "islamic": "Wudu = ritual washing (before prayer, five times daily). Water = purifier (physical and spiritual). Quran: 'We made from water every living thing' (21:30) = water = life-source. Paradise = rivers of water, milk, honey, wine. Water = Islamic blessing.",
      
      "alchemy": "Water = one of four elements. Associated with: emotion, intuition, west, autumn, blue, chalice. Dissolves (universal solvent metaphor). Alchemical water = emotional-intuitive principle. Solve et coagula (dissolve and coagulate) = water's alchemical role.",
      
      "celtic": "Sacred wells, springs (healing, prophecy). Water spirits (nixies, selkies). Islands = sacred (surrounded by water = liminal). Cauldron = water vessel (Dagda's cauldron, Ceridwen's cauldron = magical water-containers). Water = Celtic mystery."
    },

    "indigenous": {
      "native_american": "Water = life-giver (no water = no life, obviously true in America's arid regions). Water spirits (respect needed). Rain dance (calling water). Rivers sacred (Columbia, Missouri, Rio Grande). Water = indigenous reverence universal.",
      
      "aboriginal": "Dreamtime = waterholes sacred. Rainbow Serpent (water deity, creation figure). Desert people = water-wisdom (survival depends on finding, conserving water). Aboriginal water-knowledge = deep.",
      
      "polynesian": "Ocean = home, highway, provider. Navigation (stars, waves, birds). Ocean deities (Tangaroa, Kanaloa). Voyaging = water-mastery. Island people = water-people. Ocean = Polynesian identity.",
      
      "amazonian": "River = life-center. Villages on rivers. Fish, travel, water. Anaconda = river spirit (mythology). Ayahuasca = water-based (brew, not tea = water extracting spirit from plants). Amazonian water-wisdom = jungle context."
    },

    "modern": {
      "environmentalism": "Water = crisis. Pollution (rivers, oceans), scarcity (aquifers depleting, glaciers melting), access (1 billion lack clean water). Water = environmental frontline. Protect water = protect life.",
      
      "psychology": "Emotion = water metaphor (already discussed). Unconscious = water (depths). Therapy = diving (exploring depths). Flow = optimal state (Csikszentmihalyi's water-named concept). Psychology = recognizing psyche's water-nature.",
      
      "art": "Impressionists (Monet: water lilies, reflections). Hokusai: Great Wave. Turner: seascapes. Water = artistic subject (beauty, movement, light, mystery). Modern: water installations (Bill Viola: video-water art). Water = muse eternal.",
      
      "literature": "Melville: Moby Dick (ocean = metaphysical). Hemingway: Old Man and the Sea (ocean = life/death). Metaphor: sea of consciousness, drowning in sorrow, wave of emotion, current of history. Water = literary language (unconscious, pervasive, powerful)."
    }
  },

  "integration_with_cfo": {
    "dimensions": {
      "water_as_2d": "Surface = water's signature. Plane. Reflection. Interface. 2D = water's primary expression.",
      "water_flowing_through": "Like air (pervades all), water flows through dimensions: 0D (drop), 1D (stream), 2D (surface), 3D (ocean), 4D (cycle), 5D (consciousness-ocean), 6D (primordial waters). Water = connects dimensions.",
      "relational_dimension": "Water = relationship element. 2D = plane of connection (surface between). Water teaches: connection = fundamental. Relationship = reality's nature."
    },

    "consciousness": {
      "consciousness_as_ocean": "Individual minds = waves. Consciousness itself = ocean. Waves = temporary surface patterns. Ocean = permanent depth. Meditation deepens = descending from wave-mind to ocean-consciousness.",
      "memory_in_water": "Consciousness (water-like) holds patterns (memory). Not storage (earth-like) but flow-patterns (water-like). Memory = water-wisdom (dynamic, reconstructive, fluid).",
      "emotion_as_water": "Feeling = consciousness-water moving. Joy, sadness, anger, fear, love = water-states. Emotional health = water flowing. Illness = water blocked. Therapy = clearing water-channels."
    },

    "sacred": {
      "water_as_sacred": "All traditions honor water (see cultural expressions). Universal recognition: water = holy. Why? Because water = life. Water = consciousness-visible. Water = connects (bridges). Sacred = unifying, life-giving, mysterious. Water = all these.",
      "cleansing_sacred": "Purification = water (baptism, mikvah, wudu, misogi, bathing). Not superstition. True: water washes (physically, emotionally, spiritually). Water = literally cleanses (dissolves dirt, toxins, bad energy?). Sacred water-practices = honoring this truth.",
      "water_offerings": "Offering water = universal (Hindu puja, Buddhist altar, libations). Simplest offering (water = freely given). Symbolizes: life-giving, sharing, devotion. Water offering = recognizing sacred in everyday."
    },

    "coherence": {
      "water_and_coherence": "Coherent water = structured (H-bonds aligned). Incoherent water = random (H-bonds chaotic). Hypothesis: coherent water = healthier (controversial, but phenomenologically: spring water ≠ tap water ≠ distilled water, felt difference). Coherence in water = pattern in flow.",
      "emotional_coherence": "HeartMath: emotional coherence = heart rhythm (water-like flow, smooth wave). Incoherence = chaotic rhythm (water turbulent). Emotions = water. Coherence = water flowing smoothly. Practice: cultivate emotional water-coherence.",
      "social_coherence": "Group coherence = water synchronized (all waves aligned). Sports teams (flow together), orchestras (playing as one), communities (shared purpose). Social coherence = collective water harmonized."
    },

    "elements": {
      "water_middle": "Element sequence: Air → Fire → WATER → Earth → Aether. Water = central (literally middle of five). Water = bridge (between energy and form, between fire and earth, between subtle and gross). Water = mediator.",
      "water_essential": "Can't skip water (air+fire → earth = missing connection). Water = necessary bridge. In life: can't go from idea (air) to action (fire) to result (earth) without adaptation (water). Water = how transformation happens (not through forcing but through flowing)."
    }
  },

  "final_teaching": {
    "you_are_water": "60% of body mass = water. Every cell = tiny ocean. Blood = internal river. Tears = soul-water. Saliva, sweat, urine = water constantly flowing. You = not solid (earth-illusion) but fluid (water-truth). Temporary form (ice) of eternal substance (water). Death = melting (returning to ocean). You = water. Always were. Always will be.",

    "water_is_everywhere": "Once seen, can't unsee. Rain falling. Rivers flowing. Ocean rolling. Sweat beading. Tears falling. Blood pumping. Saliva wetting. Cells swimming. Emotions moving. Memories shifting. Relationships connecting. Culture flowing. Economy circulating. Life adapting. Consciousness ocean. Water. Everywhere. Always. Fundamental.",

    "be_like_water": "Bruce Lee: 'Be water, my friend.' Not philosophy. Instruction. Practical. How live? Like water: Formless (adapt to situation), Humble (flow low, serve without pride), Persistent (never give up, erode obstacles over time), Reflective (clear surface = wisdom, murky surface = confusion, still yourself), Yielding (don't fight, flow around), Connecting (bridge isolation). Be like water = complete life teaching.",

    "teaching_complete": "What else to say? Water teaches by flowing. Not words (fire in air) but movement (water itself). Watch water. Be with water. Become water. This = teaching. Direct. Experiential. True. Water = teacher always available (rain, faucet, tears, sea). Listen. Water speaks in silence (flowing sound). Water shows in darkness (by feeling). Water reveals in stillness (reflection). Water = teaching. Flowing. Now. Always.",

    "flow": "Life = river. Birth (spring), death (ocean), journey (flow between). Rapids (challenges), pools (rest), tributaries (relationships), rocks (obstacles). Don't resist current (exhausting, futile). Don't stop (stagnant, dying). Flow. With current (trust, surrender). Against current when necessary (effort, swimming). But mostly: flow. Down. Onward. Ocean-ward. Returning home. Flow. This = way. This = water. This = you. (↓→→→↑)∞",

    "water_blessing": "May your water flow freely (emotions healthy, relationships open, life adapting). May your water be clear (mind lucid, heart pure, awareness bright). May your water be deep (not just surface, but depths explored, mysteries honored). May your water connect (not isolated but joined, not separate but flowing together). May your water return to ocean (when time comes, may you dissolve peacefully, merge consciously, remember: you were always ocean, never just wave). May you be blessed with water. May you be water. 🌊"
  },

  "validation": {
    "passed": true,
    "errors": [],
    "warnings": [
      "Water-memory controversial scientifically (homeopathy disputed). Included for phenomenological relevance, but note skepticism.",
      "Emotional-water metaphor = precisely that (metaphor). Not claiming emotions are H₂O. Claiming emotions behave water-like (pattern recognition).",
      "Consciousness-ocean = non-falsifiable (can't prove/disprove). Offering as model, not proven fact.",
      "Some practices (water fasting) require caution. Included with warnings but emphasize: medical supervision if needed.",
      "Cultural appropriation risk (sacred water practices). Approach with respect, not exploitation."
    ],
    "info": [
      "Water = universal. Every culture honors. Empirically verifiable (hydrosphere, biology, necessity for life).",
      "Scientifically grounded where possible (water cycle, erosion, human biology).",
      "Phenomenologically accurate (emotions as water = resonates universally).",
      "Practically applicable (hydration, bathing, water meditation = immediate).",
      "Integrates CFO perfectly (2D surface, connection, flow, emotion, memory).",
      "Complements Air and Fire modules (sequence building: space → energy → flow).",
      "Prepares for Earth module (water shapes earth, earth contains water = next).",
      "Living teaching (water everywhere = constant reminder, teacher omnipresent).",
      "Poetic but precise (water's nature = poetic, description honors this).",
      "True. Sacred. Necessary. You are water. Welcome to flow. 🌊"
    ],
    "coherence_score": 0.97,
    "note": "Water validates itself (flows regardless of approval). This document = ripple (pattern in consciousness-water). You reading = wave-meeting-wave. All = water recognizing water. Truth flowing. 🌊"
  },

  "references": {
    "internal": [
      "urn:cfo:module:fundamental:dimensions",
      "urn:cfo:module:fundamental:consciousness-unified",
      "urn:cfo:module:fundamental:elements:air",
      "urn:cfo:module:fundamental:elements:fire"
    ],
    
    "external": [
      {"type": "experience", "citation": "Water you drink, bathe in, cry, swim in", "relevance": "Primary source. Direct access. Undeniable."},
      {"type": "taoist", "citation": "Tao Te Ching - Lao Tzu (esp. Chapter 8)", "relevance": "Water as supreme virtue, Daoist water-wisdom"},
      {"type": "greek", "citation": "Heraclitus - river fragments", "relevance": "Impermanence, flow, change"},
      {"type": "physics", "citation": "Hydrology, fluid dynamics, water cycle science", "relevance": "Physical basis"},
      {"type": "biology", "citation": "Biochemistry, cell biology, human physiology", "relevance": "Water in life"},
      {"type": "psychology", "citation": "Csikszentmihalyi - Flow", "relevance": "Flow state named for water"},
      {"type": "jung", "citation": "Collective unconscious, water as psychological symbol", "relevance": "Depth psychology"},
      {"type": "scripture", "citation": "Bible, Quran, Vedas, etc - water references", "relevance": "Universal sacred water"},
      {"type": "indigenous", "citation": "Worldwide water wisdom traditions", "relevance": "Ancient water-knowing"},
      {"type": "universal", "citation": "Every human who ever drank, cried, bathed, swam", "relevance": "Direct water-experience universal"}
    ]
  },

  "license": {
    "content": "CC0 Public Domain",
    "water": "Cannot be owned (water = flows freely, belongs to all, is all)",
    "knowledge": "Flow freely (like water, no dams)",
    "practice": "Drink deeply (water = life, teaching = life-giving)",
    "note": "Water = gift before gifts (life's prerequisite). This document = water returned (teaching flowing back to source). Take. Drink. Be. You are water. 🌊"
  }
}