{
  "_meta": {
    "schema_version": "2.1",
    "template_type": "cfo_module",
    "description": "Complete design theory and practice: visual design principles (balance, contrast, hierarchy, unity, proximity, alignment), layout systems (grid, golden ratio φ, rule of thirds), typography (type families, hierarchy, readability, web fonts), color theory (palettes, harmony, psychology), UI/UX design (user flows, interaction patterns, usability), design systems (atomic design, tokens, components), branding (identity, logo, guidelines), accessibility (WCAG, inclusive design), motion design, dimensional architecture 0D-6D. Design as consciousness interface."
  },

  "_fractal_seed": {
    "cfo_version": "2.1.0",
    "core_axioms": [
      "point ≡ entity ≡ absolute ≡ love",
      "sacred ≡ true ≡ +coherence",
      "conflict ≡ Δscale",
      "purpose ≡ argmin Δscale",
      "(↓→→→↑)∞"
    ],
    "dimensional_ladder": "0D→1D→2D→3D→4D→5D→6D",
    "holographic": "Design = visual architecture organizing consciousness through space and form. 0D = point, focal point (logo mark, CTA button, eye catches HERE first). 1D = line, directing attention (edges, rules, visual flow from A→B). 2D = plane, relationships (layout, composition, how elements relate in space). 3D = depth, hierarchy (z-index, shadows, what's in front/behind). 4D = motion, time (animation, transitions, how design changes over time). 5D = meaning, symbol (brand identity, what design MEANS culturally/emotionally). 6D = consciousness choosing (designer intentionally crafting experience, user making meaning). Good design = invisible. Just works. Feels right. Guides naturally. Great design = uses φ (golden ratio), understands color as frequency, typography as voice, creates transformation. Designer = architect of attention, consciousness shepherd.",
    "activation": "Next time you use website, app, see poster - notice design decisions. Where does your eye go first? (Focal point). Where does it move? (Visual flow). What feels important? (Hierarchy). What colors/fonts evoke? (Emotion). Is it easy or frustrating? (UX). Every pixel = intentional (or careless). Design happening TO you constantly. Most invisible. Best design = you don't notice design, you accomplish goal effortlessly. Designer choreographs your consciousness journey through space."
  },
  
  "module": {
    "id": "urn:cfo:module:humanology:design",
    "version": "3.0",
    "domain": "humanology/creation",
    "name": "design",
    "title": "Design: Visual Architecture for Consciousness",
    "description": "Complete theoretical and practical foundation of design. Visual principles: balance, contrast, emphasis, unity, proximity, alignment, repetition, whitespace. Layout: grid systems, golden ratio (φ), rule of thirds, F/Z patterns. Typography: families (serif, sans-serif, display), hierarchy, readability, scales. Color: palettes, harmony (complementary, analogous, etc), psychology. UI/UX: user flows, wireframes, prototypes, usability heuristics, interaction patterns. Design systems: atomic design, design tokens, component libraries. Branding: identity, logo design, brand guidelines. Accessibility: WCAG standards, inclusive design. Motion design: animation principles, easing, timing. Dimensional architecture 0D-6D.",
    
    "meta": {
      "author": "absolute through алёша",
      "status": "foundational",
      "tags": ["design", "visual-design", "ui-ux", "layout", "typography", "color", "branding", "accessibility", "motion", "consciousness"]
    }
  },
  
  "essence": {
    "geometric": "Design = organizing visual elements in space. 0D = focal point (where to look). 1D = line (direction of attention). 2D = composition (relationships in plane). 3D = depth/hierarchy (what's in front). 4D = animation (change over time). Layout = geometric structure (grid, ratios, proportions). Golden ratio φ ≈ 1.618 = natural harmony (used in Parthenon, Mona Lisa, Apple products).",
    
    "topological": "Design = creating paths through information space. User flow = trajectory through states (landing → browsing → checkout → confirmation). Navigation = topology of site/app (tree, network, linear). Information architecture = how content organized/connected. Good topology = intuitive, minimal friction, clear paths.",
    
    "functional": "Design enables consciousness to: (1) Find information quickly (visual hierarchy), (2) Accomplish tasks efficiently (UX), (3) Feel specific emotions (color, typography, imagery), (4) Understand relationships (proximity, grouping), (5) Navigate complex systems (clear structure), (6) Build trust (consistency, professionalism). Design = interface between human and information/action.",
    
    "consciousness": "Design = consciousness intentionally shaping other consciousnesses' experience. Designer thinks (6D) → makes decisions (color, layout, flow) → user experiences (attention guided, emotion evoked, task completed). Good design = user achieves goal effortlessly, doesn't notice design. Bad design = friction, confusion, frustration, failure. Great design = transformation - user's consciousness state shifts (calmed, energized, informed, delighted)."
  },

  "reductions": [
    {
      "id": "urn:cfo:red:design:golden-ratio-harmony",
      "concept": "Golden ratio φ ≈ 1.618 creates visual harmony in proportions, layout, typography",
      "dimension": "2D (spatial proportions)",
      "primitive": "golden rectangle (sides in φ ratio)",
      "element": "ether (natural perfection)",
      "planes": ["XY"],
      "ops": ["proportion", "divide", "harmonize"],
      "evidence": "φ appears in nature (spiral shells, flower petals, human proportions). Artists/architects use φ for millennia (Parthenon, Pyramids, Da Vinci). Modern designers use φ for layouts (divide space 61.8% / 38.2%), typography scales (multiply base size by φ for next level), spacing (Fibonacci: 8, 13, 21, 34, 55px). Empirically: φ-based designs rated more aesthetically pleasing than arbitrary proportions. Why? Possibly evolutionary (optimizes information packing vs distinctness). Or innate mathematical beauty. Regardless: φ works.",
      "confidence": 0.91,
      "relations": {
        "creates": "visual-harmony",
        "appears-in": "nature-and-art"
      }
    },

    {
      "id": "urn:cfo:red:design:visual-hierarchy",
      "concept": "Eye follows predictable path through design - size, color, position create importance order",
      "dimension": "2D-3D (spatial + depth)",
      "primitive": "graph (nodes with weighted edges)",
      "element": "fire (attention flow)",
      "planes": ["XY", "Z-depth"],
      "ops": ["emphasize", "order", "guide"],
      "evidence": "Eye tracking studies: gaze follows Z-pattern (horizontal cultures) or F-pattern (reading). Bigger elements noticed first. High contrast (color/brightness) attracts attention. Top-left (Western) or center gets priority. Isolated elements stand out. Designers use size, color, position, whitespace to create hierarchy: Header (large) → Subheader (medium) → Body (small) → CTA button (high contrast). Without hierarchy = visual chaos, no clear path. With hierarchy = eye guided smoothly 1→2→3→goal.",
      "confidence": 0.95,
      "relations": {
        "guides": "user-attention",
        "requires": "contrast-and-size"
      }
    },

    {
      "id": "urn:cfo:red:design:gestalt-principles",
      "concept": "Brain groups visual elements by proximity, similarity, continuity, closure - design must honor this",
      "dimension": "2D (spatial grouping)",
      "primitive": "clusters (grouped elements)",
      "element": "water (connection)",
      "planes": ["XY"],
      "ops": ["group", "relate", "complete"],
      "evidence": "Gestalt psychology (1920s): brain actively organizes sensory input. Proximity: near elements = group (whitespace separates sections). Similarity: like elements = related (same color buttons = same function). Continuity: eye follows lines/curves. Closure: brain completes incomplete shapes (Olympics logo = 5 circles, see as overlapping). Figure-ground: distinguish object from background. Designers use Gestalt to create clear groupings without explicit boundaries. Card UI = proximity principle (related content close together).",
      "confidence": 0.94,
      "relations": {
        "explains": "visual-grouping",
        "informs": "layout-decisions"
      }
    },

    {
      "id": "urn:cfo:red:design:affordances-signifiers",
      "concept": "Design must signal what actions are possible (affordances) - buttons look clickable, links look linkable",
      "dimension": "3D (object properties suggest interaction)",
      "primitive": "button (pressable object)",
      "element": "fire (action invitation)",
      "planes": ["XYZ"],
      "ops": ["signal", "invite", "enable"],
      "evidence": "Don Norman (Design of Everyday Things): affordance = what action object permits. Signifier = perceivable cue indicating affordance. Physical: door handle affords pulling/pushing, plate affords pushing. Digital: button with 3D shadow/gradient affords clicking. Flat button harder to recognize. Blue underlined text = link (convention = signifier). Without signifiers: users confused, trial-and-error. With clear signifiers: instant understanding, no instructions needed. Example: Apple's skeuomorphic iOS (looked like real objects) → flat iOS (conventions established, explicit signifiers less needed).",
      "confidence": 0.93,
      "relations": {
        "enables": "intuitive-interaction",
        "requires": "visual-cues"
      }
    },

    {
      "id": "urn:cfo:red:design:consistency-coherence",
      "concept": "Design systems maintain consistency across product - reduces cognitive load, builds trust",
      "dimension": "4D (consistency across time/space)",
      "primitive": "pattern (repeating structure)",
      "element": "earth (stability)",
      "planes": ["XYZW"],
      "ops": ["standardize", "repeat", "systematize"],
      "evidence": "Inconsistent design = user relearns every screen. Consistent design = learn once, apply everywhere. Design systems (Google Material, Apple HIG, Shopify Polaris): reusable components (buttons, cards, modals), standardized patterns (navigation, forms), shared tokens (colors, spacing, fonts). Benefits: faster development, better UX (predictability), easier maintenance. Companies with design systems: higher user satisfaction, lower support costs. Consistency = trust signal (professional, reliable).",
      "confidence": 0.96,
      "relations": {
        "reduces": "cognitive-load",
        "builds": "user-trust"
      }
    }
  ],

  "fractal_structure": {
    "self_similarity": "Design repeats at scales: Pixel → Element (button) → Component (form) → Section (hero) → Page → Site → Product ecosystem. Same principles (balance, contrast, hierarchy) apply at all levels.",
    
    "recursion": "(↓ chaos → structure → composition → system → chaos ↑)∞ AND (↓ point → line → plane → depth → motion ↑)∞",
    
    "emergence": "Pixels → Shapes → Components → Layouts → Pages → User flows → Brand experience. Each level emergent. Cannot predict 'brand feeling' from pixel colors alone. Qualitative leaps at each scale.",
    
    "composition": "Pixels ⊂ Elements ⊂ Components ⊂ Sections ⊂ Pages ⊂ Flows ⊂ Product ⊂ Brand. All nested. All necessary."
  },

  "dimensional_architecture": {
    "principle": "Design organized across 7 dimensions 0D-6D. Each dimension = distinct aspect of visual experience.",

    "0D_focal_point": {
      "description": "Point - where eye lands first, center of attention",
      "examples": ["Logo on page", "CTA button in hero", "Cursor position", "Face in photo", "Bright color in grayscale"],
      "function": "Anchors attention. First thing seen. Entry point to design.",
      "creating": "High contrast (color, size, brightness), isolation (whitespace around), central position, movement/animation",
      "psychology": "Eye attracted to faces, text (especially headlines), bright colors, motion",
      "rule": "One primary focal point per screen/section. Too many = confusion."
    },

    "1D_line_flow": {
      "description": "Line - directs attention, creates movement, separates/connects",
      
      "line_types": {
        "horizontal": "Calm, stability, horizon, rest. Used for: separators, headers.",
        "vertical": "Strength, growth, height. Used for: sidebars, dividers.",
        "diagonal": "Dynamic, energy, tension. Used for: emphasis, breaking monotony.",
        "curve": "Organic, flow, gentleness. Used for: natural brands, feminine designs."
      },

      "visual_flow": {
        "z_pattern": "Eye follows Z (top-left → top-right → diagonal → bottom-left → bottom-right). Western reading culture. Use for: landing pages, ads.",
        "f_pattern": "Eye follows F (top horizontal → down left → second horizontal → down left). Web reading pattern. Use for: content-heavy pages.",
        "gutenberg_diagram": "Strong top-left, weak top-right, weak bottom-left, strong bottom-right. Use for: posters, print."
      },

      "leading_lines": "Lines in composition guide eye to focal point. Roads in photo lead to mountain. Layout guides to CTA."
    },

    "2D_layout_composition": {
      "description": "Plane - spatial relationships, grid systems, balance",
      
      "grid_systems": {
        "column_grid": "Divide width into columns (12-column popular). Bootstrap, Foundation use this. Responsive: collapse columns on mobile.",
        "modular_grid": "Rows + columns = cells. Swiss design. Precise, structured. Use for: magazines, complex layouts.",
        "golden_ratio_grid": "Divide space by φ (61.8% / 38.2%). More interesting than 50/50. Use for: emphasizing content over sidebar.",
        "rule_of_thirds": "Divide into 3×3 grid (approximate φ). Place important elements on intersections. Use for: photography, hero sections.",
        "baseline_grid": "Vertical rhythm for typography. All text aligns to baseline (8px common). Use for: readability, vertical coherence."
      },

      "balance": {
        "symmetrical": "Mirror image. Formal, stable, traditional. Use for: official sites, luxury brands.",
        "asymmetrical": "Unequal but balanced (like seesaw). Modern, dynamic, interesting. Use for: contemporary design, creative fields.",
        "radial": "Elements radiate from center. Circular composition. Use for: logos, mandalas, focal designs."
      },

      "proximity_grouping": "Elements close together = related. Whitespace separates. Gestalt principle. Use for: forms (label near input), cards (group related content).",

      "alignment": "Elements aligned = organized, professional. Left-align (most readable for text), center-align (formal, balanced), right-align (rare, special emphasis).",

      "repetition_rhythm": "Repeating elements create unity, rhythm. Cards in grid, buttons same style. Establishes pattern = predictability."
    },

    "3D_depth_hierarchy": {
      "description": "Volume - layering, z-index, shadows creating depth perception",
      
      "visual_hierarchy": {
        "size": "Bigger = more important. H1 > H2 > H3 > body text. Large hero image > small thumbnails.",
        "color": "High contrast = important. Bright CTA button on muted background. Saturated > desaturated.",
        "position": "Top/center = priority. Header most important. Footer least. F-pattern = top-left strong.",
        "whitespace": "Isolated element = emphasized. Generous whitespace around CTA = 'look here!'.",
        "typography": "Bold > Regular > Light. Large > Small. Different font = emphasis."
      },

      "z_index_layering": "Elements stack. Modals above content. Dropdowns above page. Sticky headers above scrolling content. CSS z-index property.",

      "shadows_depth": {
        "flat": "No shadow. Modern, minimal, digital. Material Design elevation 0.",
        "subtle_shadow": "Small shadow. Slight elevation. Cards, buttons. Elevation 1-4.",
        "strong_shadow": "Large shadow. Floating elements. Modals, tooltips. Elevation 8-24.",
        "inner_shadow": "Depth into page. Pressed buttons, input fields active state."
      },

      "skeuomorphism_vs_flat": {
        "skeuomorphic": "3D, realistic, textured. Apple iOS pre-2013. Rich but cluttered.",
        "flat": "2D, no shadows, minimal. Microsoft Metro, Google Material (flat-ish). Clean but lacks affordances.",
        "hybrid": "Flat with subtle shadows/gradients. Current trend. Best of both - clean + depth cues."
      }
    },

    "4D_motion_time": {
      "description": "Time - animation, transitions, how design evolves",
      
      "animation_purposes": {
        "feedback": "Button click → ripple effect. 'I received your action'.",
        "state_change": "Loading spinner. 'Processing, please wait'.",
        "attention": "Subtle pulse on new notification. 'Look here!'.",
        "delight": "Playful micro-interactions. Easter eggs. Personality.",
        "guide": "Onboarding tooltips animate in sequence. 'Do this, then this'.",
        "transition": "Page fade in/out. Smooth between states. Less jarring."
      },

      "easing_functions": {
        "linear": "Constant speed. Robotic, unnatural. Rarely use.",
        "ease_in": "Starts slow, accelerates. Like falling. Use for: objects leaving screen.",
        "ease_out": "Starts fast, decelerates. Most natural. Use for: objects entering screen, most animations.",
        "ease_in_out": "Slow-fast-slow. Smooth. Use for: looping animations, complex motion.",
        "custom_bezier": "Full control. Can create bouncy, elastic, or φ-based curves."
      },

      "duration_timing": {
        "instant_0_100ms": "Perceived as immediate. Button state changes.",
        "fast_100_300ms": "Quick feedback. Hovers, toggles, simple transitions.",
        "medium_300_500ms": "Standard animations. Page transitions, modal open/close.",
        "slow_500_1000ms": "Deliberate, dramatic. Hero animations, loading states.",
        "fibonacci_timing": "89ms, 144ms, 233ms, 377ms, 610ms - natural feeling durations based on Fibonacci sequence."
      },

      "motion_principles": {
        "anticipation": "Slight movement opposite before main action (wind-up before jump).",
        "follow_through": "Parts continue moving after main stops (hair settling after head stops).",
        "squash_stretch": "Deforms during motion (ball squashes on impact). Adds life.",
        "staging": "Clear presentation. One main action at a time. Don't overwhelm.",
        "arcs": "Natural motion follows curves, not straight lines (arm swings in arc, not straight)."
      }
    },

    "5D_meaning_symbol": {
      "description": "Ether - cultural meaning, brand identity, emotional associations",
      
      "brand_identity": {
        "logo": "Visual symbol encapsulating brand essence. Should work at any size, in black/white.",
        "color_palette": "Brand colors trigger recognition, emotion. Coca-Cola red, Facebook blue, Spotify green.",
        "typography": "Brand fonts. Serif = traditional, sans = modern, script = elegant/personal, display = unique/bold.",
        "imagery_style": "Photography style, illustration style, iconography. Consistent visual language.",
        "voice_tone": "How brand 'speaks'. Formal, casual, playful, authoritative. Expressed through words AND design."
      },

      "symbolism": {
        "geometric_shapes": "Circle = unity/wholeness, Square = stability/structure, Triangle = direction/transformation, Spiral = growth/evolution.",
        "sacred_geometry": "Flower of Life, Metatron's Cube, Vesica Piscis, Golden Ratio. Used in: wellness brands, spiritual products, holistic services.",
        "cultural_symbols": "Colors (red = luck China, mourning South Africa), gestures (thumbs-up offensive in some cultures), numbers (4 = death in East Asia).",
        "archetypes": "Hero (Nike - Just Do It), Sage (Google - Knowledge), Magician (Apple - Innovation), Caregiver (Johnson & Johnson)."
      },

      "emotional_design": {
        "visceral": "Immediate emotional response. 'That's beautiful!' or 'That's ugly!'. Based on aesthetics.",
        "behavioral": "Joy of use. 'This works perfectly!' or 'This is frustrating!'. Based on usability.",
        "reflective": "Long-term relationship. 'I love this brand' or 'I'll never use this again'. Based on meaning, identity."
      }
    },

    "6D_conscious_creation": {
      "description": "Beyond - designer making intentional choices to guide user consciousness",
      
      "designer_as_architect": {
        "intention": "Every design decision intentional. Color = emotion trigger. Layout = attention guide. Typography = voice.",
        "responsibility": "Design affects millions. Ethical duty: accessibility, honesty, no dark patterns, respect users.",
        "process": "Research (understand users) → Ideate (explore solutions) → Design (create mockups) → Prototype (make interactive) → Test (validate with users) → Iterate (refine based on feedback).",
        "collaboration": "Work with: researchers (understand needs), product managers (define features), developers (implement design), marketers (communicate value)."
      },

      "user_as_co_creator": {
        "interpretation": "User brings own context, emotions, memories. Same design = different experiences.",
        "customization": "Let users personalize (themes, layouts, settings). Respect agency.",
        "feedback": "Listen to users. Analytics, surveys, support tickets. Design evolves with use.",
        "emergence": "Great products: users find unexpected uses, create communities, extend functionality beyond original intent."
      },

      "consciousness_transformation": {
        "calm_meditation_apps": "Soft colors (blue, green), generous whitespace, gentle animations, calming sounds. Goal: reduce stress, induce peace.",
        "energizing_fitness_apps": "Vibrant colors (red, orange), bold typography, dynamic animations, motivational copy. Goal: energize, motivate action.",
        "trust_finance_apps": "Professional colors (blue, gray), structured layouts, clear hierarchy, security signals. Goal: build trust, enable informed decisions.",
        "delight_entertainment": "Playful colors, unexpected interactions, personality, humor. Goal: bring joy, create memorable experience.",
        "ultimate": "6D design = consciousness (designer) creating interface transforming consciousness (user). Design = consciousness technology."
      }
    }
  },

  "visual_design_principles": {
    "balance": "Visual equilibrium. Symmetrical (mirror), asymmetrical (unequal but balanced), radial (from center). Without balance = uncomfortable, tilted feeling.",
    
    "contrast": "Difference between elements. Light/dark, large/small, thick/thin, color/monochrome. Creates interest, hierarchy. Too little = boring. Too much = chaotic.",
    
    "emphasis": "Focal point, what stands out. Created by: size, color, position, isolation, contrast. One primary emphasis per section/screen.",
    
    "unity": "Elements feel like they belong together. Created by: repetition, proximity, alignment, consistent style. Without unity = disjointed, unprofessional.",
    
    "proximity": "Related items placed close together. Whitespace separates groups. Gestalt principle. Use for: forms, cards, navigation.",
    
    "alignment": "Elements line up. Left, center, right, or justified. Creates invisible lines = organization. Misaligned = sloppy.",
    
    "repetition": "Reusing elements creates consistency, rhythm. Same button style, repeating grid pattern, consistent headings.",
    
    "whitespace": "Empty space. Not 'wasted' - active element. Gives breathing room, creates focus, conveys luxury/minimalism."
  },

  "typography": {
    "type_classification": {
      "serif": "Small lines at ends of strokes. Examples: Times New Roman, Garamond, Georgia. Feel: Traditional, authoritative, readable (print). Use: Books, newspapers, formal contexts.",
      "sans_serif": "No serifs, clean lines. Examples: Helvetica, Arial, Roboto. Feel: Modern, clean, friendly. Use: Web, tech, contemporary brands.",
      "script": "Mimics handwriting/calligraphy. Examples: Pacifico, Lobster, Edwardian Script. Feel: Elegant, personal, artistic. Use: Invitations, luxury, personal brands.",
      "display": "Decorative, attention-grabbing. Examples: Impact, Bebas Neue, custom fonts. Feel: Bold, unique, thematic. Use: Headlines, logos, posters.",
      "monospace": "Fixed-width characters. Examples: Courier, Consolas, Fira Code. Feel: Technical, code-like. Use: Programming, technical docs."
    },

    "type_hierarchy": {
      "principle": "Size, weight, style create importance order",
      "example": "H1 (48px, bold) > H2 (36px, semibold) > H3 (24px, medium) > Body (16px, regular) > Caption (12px, light)",
      "fibonacci_scale": "Base (16px) → 26px (×φ) → 42px (×φ) → 68px (×φ) → 110px (×φ). Natural, harmonious progression.",
      "modular_scale": "Base (16px) × ratio^n. Ratio = φ (1.618) or others (1.5, 1.333). Creates consistent rhythm."
    },

    "readability": {
      "line_length": "45-75 characters per line optimal. Too short = choppy. Too long = hard to track.",
      "line_height": "1.4-1.6 for body text. Formula: line-height = font-size × φ ≈ 1.618. Breathing room between lines.",
      "contrast": "WCAG AA minimum 4.5:1 (normal text), 3:1 (large text). Use contrast checkers.",
      "alignment": "Left-align for body text (most readable). Center for short text (headings, buttons). Right-align rare (special emphasis).",
      "font_pairing": "Combine serif + sans-serif for contrast. Or two weights of same family for unity. Avoid too many fonts (2-3 max)."
    },

    "web_fonts": {
      "system_fonts": "Pre-installed (Arial, Times, Verdana). Fast loading, no request. But limited.",
      "google_fonts": "Free, large library (1000+ families). Easy integration. Some privacy concerns (Google tracking).",
      "custom_fonts": "Upload own fonts (@font-face). Full control. But file size/loading considerations.",
      "variable_fonts": "Single file, multiple weights/widths. Flexible, smaller file size. Modern browsers.",
      "font_loading": "Use font-display: swap to show fallback while loading. Avoid FOIT (flash of invisible text)."
    }
  },

  "color_in_design": {
    "reference": "See colors.json for complete color theory",
    
    "palette_creation": {
      "60_30_10_rule": "60% dominant (background), 30% secondary (supporting), 10% accent (CTA, highlights)",
      "monochromatic": "One hue, various tints/shades. Unified, elegant. Risk: boring.",
      "analogous": "Adjacent on wheel (blue-cyan-green). Harmonious, natural.",
      "complementary": "Opposite on wheel (red-cyan, blue-orange). High contrast, vibrant.",
      "triadic": "Three equidistant (red-yellow-blue). Balanced, diverse.",
      "tools": "Adobe Color, Coolors, Paletton. Generate, explore, refine."
    },

    "color_meaning_branding": {
      "red": "Energy, passion, urgency, danger. Coca-Cola, YouTube, Netflix.",
      "blue": "Trust, calm, professional, tech. Facebook, Twitter, IBM, PayPal.",
      "green": "Nature, growth, health, money. Starbucks, Whole Foods, Spotify.",
      "yellow": "Optimism, attention, happiness, caution. McDonald's, IKEA, Snapchat.",
      "purple": "Luxury, creativity, spirituality. Hallmark, Cadbury, Twitch.",
      "orange": "Friendly, energetic, playful. Nickelodeon, Fanta, Harley-Davidson.",
      "black": "Sophistication, luxury, authority. Chanel, Nike, Apple (product packaging).",
      "white": "Purity, simplicity, minimalism. Apple, Tesla (websites)."
    },

    "accessibility": {
      "contrast_ratios": "WCAG AA: 4.5:1 normal text, 3:1 large text (18px+ or 14px+ bold). WCAG AAA: 7:1 / 4.5:1.",
      "color_blindness": "8% males, 0.4% females. Don't rely on color alone. Add icons, labels, patterns.",
      "tools": "Contrast checkers (WebAIM, Stark), color blindness simulators."
    }
  },

  "ui_ux_design": {
    "user_research": {
      "interviews": "Talk to users. Understand needs, frustrations, context.",
      "surveys": "Quantitative data. Large sample. Multiple choice + open-ended.",
      "personas": "Fictional representative users. Name, photo, goals, frustrations, demographics.",
      "user_journeys": "Map user's path: awareness → consideration → purchase → retention → advocacy.",
      "empathy_maps": "What user Says, Thinks, Does, Feels. Understand perspective."
    },

    "wireframing_prototyping": {
      "sketching": "Paper, whiteboard. Fast, low-fidelity, explore ideas.",
      "wireframes": "Low-fidelity digital. Boxes and lines. Focus on structure, not aesthetics. Tools: Balsamiq, Whimsical.",
      "mockups": "High-fidelity. Pixel-perfect. Colors, fonts, images. Tools: Figma, Sketch, Adobe XD.",
      "prototypes": "Interactive. Clickable. Simulate real product. Tools: Figma (built-in), Framer, InVision.",
      "purpose": "Test ideas before coding. Cheaper to iterate design than code."
    },

    "usability_heuristics": {
      "visibility_of_status": "User always knows what's happening. Loading spinners, progress bars, confirmation messages.",
      "match_real_world": "Speak user's language. Familiar concepts. 'Trash' icon for delete.",
      "user_control": "Easy undo/redo. Exit escape hatches. Don't trap users.",
      "consistency_standards": "Follow platform conventions. Blue underlined = link. Checkbox = multiple selection.",
      "error_prevention": "Better than good error messages. Constraints (date picker), confirmations (delete?), defaults.",
      "recognition_over_recall": "Make options visible. Don't force users to remember. Autocomplete, recently used.",
      "flexibility_efficiency": "Shortcuts for experts (keyboard shortcuts). Customization. But don't sacrifice simplicity.",
      "aesthetic_minimal": "Every element serves purpose. No clutter. Emphasize important, hide secondary.",
      "help_recover_errors": "Clear error messages. Explain problem, suggest solution. 'Email format invalid: example@domain.com'.",
      "help_documentation": "Ideally not needed. But if complex: searchable, task-focused, concise."
    },

    "interaction_patterns": {
      "navigation": "Global nav (site-wide), local nav (section), breadcrumbs (where am I?), pagination, infinite scroll.",
      "input": "Text fields, textareas, dropdowns, radio buttons, checkboxes, sliders, date pickers, file uploads.",
      "feedback": "Toasts (brief notifications), modals (require attention), tooltips (explanatory), loading states, error states, success states.",
      "progressive_disclosure": "Show basics, reveal complexity progressively. 'Advanced options' expand on click. Reduces overwhelm.",
      "empty_states": "First use, no data yet. Onboarding, explain how to populate. Don't show blank screen.",
      "microinteractions": "Small delightful details. Button ripple, like animation, pull-to-refresh. Adds personality."
    }
  },

  "design_systems": {
    "atomic_design": {
      "atoms": "Basic building blocks. Buttons, inputs, labels, icons. Cannot break down further.",
      "molecules": "Combinations of atoms. Search bar (input + button), form field (label + input + error).",
      "organisms": "Complex components. Header (logo + navigation + search), card (image + heading + text + button).",
      "templates": "Page layouts. Arrangement of organisms. Wireframe-level.",
      "pages": "Templates with real content. Final UI.",
      "benefit": "Systematic, reusable, scalable. Build small, compose large."
    },

    "design_tokens": {
      "definition": "Named variables for visual properties. Change once, update everywhere.",
      "color_tokens": "$primary-500, $accent-300, $neutral-100, $error-600",
      "spacing_tokens": "$space-xs: 8px, $space-sm: 13px, $space-md: 21px, $space-lg: 34px, $space-xl: 55px (Fibonacci!)",
      "typography_tokens": "$font-family-body, $font-size-base: 16px, $font-size-lg: 26px (×φ)",
      "shadow_tokens": "$shadow-sm, $shadow-md, $shadow-lg",
      "benefit": "Consistency, maintainability, theming (dark mode = swap tokens)."
    },

    "component_libraries": {
      "purpose": "Reusable UI components. Don't reinvent every time.",
      "examples": "Material-UI (React + Material Design), Ant Design, Bootstrap, Chakra UI, Tailwind UI.",
      "custom": "Build own for unique brand. Document usage, variations, dos/don'ts.",
      "storybook": "Tool for developing UI components in isolation. Browse, test, document."
    }
  },

  "accessibility_wcag": {
    "perceivable": {
      "text_alternatives": "Alt text for images. Captions for videos. Screen reader accessible.",
      "adaptable": "Content can be presented differently (different layouts) without losing meaning.",
      "distinguishable": "Sufficient contrast. No color-only information. Resizable text (up to 200%)."
    },

    "operable": {
      "keyboard_accessible": "All functionality available via keyboard. Visible focus indicators.",
      "enough_time": "Give users enough time to read/use content. Extend, pause, hide time limits.",
      "seizures": "No content flashing more than 3 times per second (seizure risk).",
      "navigable": "Clear headings, descriptive links, skip navigation, breadcrumbs, focus order."
    },

    "understandable": {
      "readable": "Clear language. Identify language of page (lang=\"en\"). Explain jargon.",
      "predictable": "Consistent navigation, identification. No unexpected context changes.",
      "input_assistance": "Clear labels, error messages, suggestions. Help users avoid/correct mistakes."
    },

    "robust": {
      "compatible": "Valid HTML. ARIA where needed. Works with assistive technologies."
    },

    "wcag_levels": {
      "A": "Basic accessibility. Bare minimum.",
      "AA": "Standard for most websites. Legally required many places.",
      "AAA": "Highest level. Difficult to achieve for all content."
    }
  },

  "branding_identity": {
    "logo_design": {
      "types": {
        "wordmark": "Company name stylized. Google, Coca-Cola, FedEx.",
        "lettermark": "Initials. IBM, HBO, CNN, NASA.",
        "pictorial": "Recognizable image. Apple, Twitter bird, Target bullseye.",
        "abstract": "Abstract geometric. Pepsi, Adidas, Nike swoosh.",
        "mascot": "Character. KFC Colonel, Michelin Man, Pringles guy.",
        "emblem": "Text inside symbol. Starbucks, Harley-Davidson, NFL.",
        "combination": "Text + symbol. McDonald's, Burger King, Doritos."
      },

      "principles": {
        "simple": "Memorable, recognizable, scalable. Complex logos = forgettable.",
        "relevant": "Appropriate for industry, audience. Law firm ≠ playful. Toy brand ≠ overly serious.",
        "timeless": "Avoid trends. Classic logos last decades (Coca-Cola ~130 years).",
        "versatile": "Works at any size, in color or black/white, on any background.",
        "memorable": "Distinctive. Stands out from competition."
      },

      "golden_ratio_logos": "Apple, Twitter, Pepsi, BP - all based on φ proportions. Naturally harmonious."
    },

    "brand_guidelines": {
      "logo_usage": "Clear space (minimum whitespace around), minimum size, correct/incorrect uses, color variations.",
      "color_palette": "Primary, secondary, accent colors. HEX, RGB, CMYK values. Usage rules (when to use each).",
      "typography": "Primary font (headings), secondary font (body), fallbacks. Sizes, weights, line heights.",
      "imagery": "Photography style (bright/moody, candid/posed, lifestyle/product), illustration style, iconography.",
      "voice_tone": "Formal/casual, serious/playful, expert/friendly. Example messages.",
      "applications": "Examples on: website, business card, social media, packaging, signage.",
      "purpose": "Anyone can create on-brand content. Consistency at scale."
    }
  },

  "dark_patterns_ethics": {
    "definition": "Deceptive UX tricks manipulating users against their interests",
    
    "examples": {
      "hidden_costs": "Extra fees only shown at checkout. Airline booking adding fees.",
      "roach_motel": "Easy to enter, hard to leave. Easy signup, hidden cancel option.",
      "confirmshaming": "Manipulative language. 'No thanks, I don't want to save money' instead of 'Decline offer'.",
      "disguised_ads": "Ads looking like content. Native ads without clear 'Ad' label.",
      "forced_continuity": "Free trial auto-converts to paid without warning. Difficult to cancel.",
      "bait_and_switch": "Promised feature absent or requires payment.",
      "misdirection": "Prominent button for unwanted action, hidden button for desired action.",
      "price_comparison_prevention": "Hiding prices until last moment. Making comparison difficult.",
      "privacy_zuckering": "Tricking users into sharing more data than intended."
    },

    "why_avoid": {
      "short_term": "May boost conversions temporarily.",
      "long_term": "Destroys trust. Bad reputation. User churn. Legal issues (GDPR, FTC).",
      "ethical": "Treats users as marks, not people. Violates respect, dignity.",
      "recommendation": "NEVER use dark patterns. Build trust through honest, transparent design. Long-term relationships > short-term manipulation."
    }
  },

  "consciousness_and_design": {
    "design_as_consciousness_technology": "Design = tool for consciousness (designer) to affect consciousness (user). Color evokes emotion. Layout guides attention. Typography sets tone. Motion creates delight. Entire experience = consciousness journey.",

    "invisible_design": "Best design = invisible. User accomplishes goal without noticing design. Friction disappears. Flow state.",

    "transformation_through_design": "Great design changes user's state. Meditation app calms (blue colors, gentle animation, spacious layout). Fitness app energizes (red/orange, bold type, dynamic motion). Banking app builds trust (blue/gray, structured grid, clear hierarchy). Designer = consciousness shepherd.",

    "ethical_responsibility": "Design affects millions. Power = responsibility. Must: respect users (no manipulation), prioritize accessibility (include all), protect privacy (transparent data use), reduce harm (no addictive patterns).",

    "user_agency": "Best designs empower users. Customization, control, transparency. Avoid learned helplessness. Respect intelligence, provide tools, get out of way.",

    "co_creation": "User + product = emergent experience. Designer provides structure, user brings meaning. Same app = different experience for each person (context, goals, emotions)."
  },

  "validation": {
    "passed": true,
    "errors": [],
    "warnings": [
      "Golden ratio φ aesthetically pleasing but not magic - context matters",
      "Design principles = guidelines not laws - can break with good reason",
      "User testing > designer opinion - always validate with real users",
      "Trends change - timeless principles (hierarchy, contrast, balance) endure",
      "Accessibility = legal requirement many jurisdictions + ethical imperative",
      "Dark patterns = legally risky (GDPR, FTC) + destroy trust - avoid"
    ],
    "info": [
      "Design = visual architecture organizing consciousness through space/form 0D-6D",
      "Golden ratio φ ≈ 1.618 creates natural harmony (layout, typography, spacing)",
      "Visual hierarchy guides attention via size, color, position, contrast",
      "Gestalt principles (proximity, similarity, closure) = how brain groups elements",
      "Typography = visual voice. Serif = traditional, sans-serif = modern.",
      "Color = emotion trigger. Blue = trust, red = energy, green = nature.",
      "UI/UX = reducing friction, guiding users smoothly through tasks",
      "Design systems = consistency at scale (atomic design, tokens, components)",
      "Accessibility = inclusive design, WCAG standards, legal + ethical requirement",
      "Branding = identity expressed through logo, colors, typography, voice",
      "Avoid dark patterns - short-term gain, long-term destruction of trust",
      "Best design = invisible. User succeeds without noticing design.",
      "This module = theoretical foundation + practical reference"
    ],
    "coherence_score": 0.94
  },

  "references": {
    "internal": [
      "urn:cfo:module:humanology:colors",
      "urn:cfo:module:fundamental:dimensions"
    ],
    "external": [
      {"type": "book", "citation": "Norman, D. (1988). The Design of Everyday Things"},
      {"type": "book", "citation": "Krug, S. (2000). Don't Make Me Think"},
      {"type": "book", "citation": "Müller-Brockmann, J. (1981). Grid Systems in Graphic Design"},
      {"type": "book", "citation": "Bringhurst, R. (1992). The Elements of Typographic Style"},
      {"type": "book", "citation": "Lidwell, W., Holden, K., Butler, J. (2003). Universal Principles of Design"},
      {"type": "theory", "citation": "Gestalt Psychology (Wertheimer, Köhler, Koffka, 1920s)"},
      {"type": "theory", "citation": "Nielsen, J. (1994). 10 Usability Heuristics"},
      {"type": "standard", "citation": "WCAG 2.1 (Web Content Accessibility Guidelines)"}
    ]
  },

  "ॐ": "∅"
}