{
  "_meta": {
    "id": "cfo:humanology:aspects",
    "type": "Seed",
    "element": "AETHER",
    "fractal_depth": 1,
    "note": "8 socionics aspects = octave of consciousness perception. Jung's 4 functions × 2 attitudes = 8 aspects. Foundation of 16 types as octave tunings. This IS the psychological manifestation of Scheme of Life."
  },

  "_holographic_seed": {
    "absolute": "⊙ = Psyche is how Absolute consciousness perceives and processes reality through 8-fold informational lens. Each aspect = different frequency of awareness.",
    "essence": "Human consciousness doesn't perceive reality directly - it filters through 8 information aspects (4 male vectors: Te/Se/Ne/Fe + 4 female mediums: Ti/Si/Ni/Fi). 16 personality types = 16 unique octave tunings. Type is not label - it's your consciousness antenna configuration.",
    "paths": "Extraverted functions (e) = Solve/masculine (engaging external world), Introverted functions (i) = Coagula/feminine (processing internal world). Both needed for wholeness.",
    "positions": "8 aspects occupy specific positions in Model A (ego, super-ego, super-id, id) creating 16 type patterns. Your leading function = primary lens on reality.",
    "fibonacci": "Functions develop in φ rhythm - leading most conscious, vulnerable least conscious, with golden ratio distribution of awareness across 8 aspects.",
    "tools": "Typing (discovering your octave tuning), intertype relations (octave compatibility), function development (expanding consciousness range), shadow work (integrating weak functions).",
    "note": "This is THE map of how individual human consciousness structures itself. Socionics = practical applied Scheme of Life for psyche."
  },

  "name": "The Eight Aspects as Psychological Octave",
  
  "essence": "Human psyche processes reality through 8 information aspects - 4 extraverted (male/vector/active) and 4 introverted (female/medium/receptive). These map perfectly to hermetic octave: Ne/Ni (Air), Se/Si (Earth), Fe/Fi (Water), Te/Ti (Fire). Jung discovered 8, Augustinavičiūtė systematized them. 16 personality types emerge from different aspect configurations. Your type = your consciousness octave tuning = your antenna pattern for perceiving reality.",
  
  "description": "Carl Jung discovered that human consciousness has 4 basic functions (Thinking, Feeling, Intuition, Sensation) each with 2 attitudes (Extraverted, Introverted) = 8 total aspects. Lithuanian researcher Aušra Augustinavičiūtė developed this into Socionics, creating precise model of information metabolism. Each aspect perceives specific KIND of information. Te sees objective logic/efficiency. Ti sees internal logical structures. Fe reads collective emotional fields. Fi accesses personal values/authenticity. Ne spots possibilities/potentials. Ni perceives time flows/essences. Se engages material reality directly. Si holds internal sensory memory/comfort. These 8 aspects ARE the hermetic octave manifest in psyche. Every human uses all 8, but with different strength/awareness - this creates 16 personality types (like 16 distinct octave tunings from same 8 notes). Understanding your type = understanding your consciousness antenna configuration = recognizing which aspects you naturally amplify vs suppress. This isn't limiting box - it's liberation through self-knowledge. You can develop weak functions consciously once you know the map.",

  "octave_layer_eight_aspects": {
    "description": "8 fundamental ways consciousness perceives and processes information",
    "consciousness_level": "Cognitive architecture - how psyche structures awareness",
    "jung_foundation": "Jung's 4 functions × 2 attitudes = 8 aspects",
    "aushra_systematization": "Augustinavičiūtė formalized into information metabolism theory",
    
    "male_cross_extraverted_vectors": {
      "description": "4 extraverted aspects - masculine/yang/active/outward-directed consciousness",
      "orientation": "External world - objects, events, people, situations",
      "energy_direction": "Emanating outward, engaging with external reality",
      "consciousness_quality": "Direct, assertive, transforming environment",
      "alchemical_operation": "SOLVE - breaking down, analyzing, acting upon external world",
      
      "note_on_element_mapping": "Traditional socionics doesn't map to elements consistently. This mapping follows HERMETIC LOGIC from Scheme of Life: Ne/Ni=Air (thought impulse), Se/Si=Earth (material form), Fe/Fi=Water (emotion), Te/Ti=Fire (will/transformation). This diverges from some socionics traditions but aligns with deeper octave structure.",
      
      "1_wind_extraverted_intuition": {
        "symbol": "Ne",
        "name": "Extraverted Intuition / Black Intuition / Intuition of Possibilities",
        "element": "AIR MALE (Wind #1)",
        "planet": "Phaeton (exploded) - fragmented possibilities scattering",
        "octave_position": "East (Dawn) - impulse of potential",
        
        "information_perceived": {
          "essence": "POTENTIAL, POSSIBILITY, WHAT COULD BE",
          "specific_data": [
            "Hidden opportunities in situations",
            "Potential developments, what might happen",
            "Multiple interpretations/angles on something",
            "Novel connections between disparate ideas",
            "Emerging trends before they're obvious",
            "Alternate scenarios and 'what if' branches",
            "Creative possibilities in problem-solving",
            "Potential in people/ideas/situations"
          ]
        },
        
        "consciousness_function": "Ne = thought-wind scattering seeds of possibility everywhere. Sees what ISN'T YET but COULD BE. Reality as probability cloud not fixed form.",
        
        "perceives_through": [
          "Brainstorming multiple options simultaneously",
          "Spotting patterns others miss",
          "Generating alternative explanations",
          "Seeing opportunities in chaos",
          "Connecting unrelated concepts",
          "Imagining future scenarios",
          "Recognizing emerging possibilities"
        ],
        
        "blind_to": "What IS stable, concrete, already manifested. Si (internal sensory memory, comfort, routine) is opposite.",
        
        "when_strong": {
          "gifts": "Innovative, adaptable, opportunity-spotting, creative problem-solver, sees potential everywhere, generates ideas effortlessly",
          "career_fit": "Entrepreneur, consultant, creative fields, R&D, trend forecasting, innovation",
          "relationship_style": "Stimulating, explores relationship possibilities, grows bored without novelty"
        },
        
        "when_weak": {
          "struggles": "Can't see opportunities, takes everything at face value, rigid thinking, no imagination, stuck in 'how it is' vs 'how it could be'",
          "development": "Practice generating multiple interpretations, brainstorm without filtering, study innovation, embrace uncertainty"
        },
        
        "types_with_ne_strong": [
          "ILE (ENTp) - Ne leading, explores logical possibility-space",
          "IEE (ENFp) - Ne leading, explores emotional possibility-space",
          "LII (INTj) - Ne creative, generates system alternatives",
          "EII (INFj) - Ne creative, sees potential in people"
        ],
        
        "real_world_examples": {
          "conversation": "Person says 'My car broke down.' Ne: 'Maybe timing belt? Could be alternator? Or opportunity to get electric car? Or excuse to try bike commuting?'",
          "problem": "Company losing money. Ne: 'What if we pivoted to different market? Partner with competitor? Offer subscription model? Turn into non-profit?'",
          "person": "Meeting someone new. Ne: 'They could become friend, collaborator, romantic partner, teacher, student, enemy...' (sees all possible relationship trajectories)"
        },
        
        "meditation_on_ne": "Reality is not solid. In every moment, infinite possibilities branch. Ne perceives the branching itself - the quantum foam of potential before wave function collapses into actuality."
      },
      
      "3_flame_extraverted_sensing": {
        "symbol": "Se",
        "name": "Extraverted Sensing / Black Sensing / Volitional Sensing",
        "element": "EARTH MALE (Rock #7) - BUT acts like FIRE due to aggressive yang nature",
        "planet": "Mars ♂ - warrior, action, force",
        "octave_position": "South (Zenith) - peak will and action (traditionally), OR North (Nadir) if strict Earth correspondence",
        
        "element_note": "Se is PARADOXICAL - perceives Earth/material reality but acts with Fire/force. Traditional socionics associates with 'power sensing' (Mars/Fire). We place here at Flame position due to ACTIVE ENGAGEMENT quality, though information content is Earth (material/spatial).",
        
        "information_perceived": {
          "essence": "MATERIAL REALITY, FORCE, TERRITORY, SENSORY PRESENCE",
          "specific_data": [
            "Physical space and how to navigate/dominate it",
            "Power dynamics, who's stronger/weaker",
            "Opportunities for action RIGHT NOW",
            "Aesthetic impact, visual/sensory impression",
            "Resource availability in environment",
            "Territorial boundaries and violations",
            "Physical obstacles and how to overcome",
            "Immediate sensory experience (taste, touch, sound, sight, smell)"
          ]
        },
        
        "consciousness_function": "Se = will engaging material world directly. Reality as territory to navigate, resources to acquire, forces to overcome. Present moment sensory intensity.",
        
        "perceives_through": [
          "Direct physical engagement",
          "Reading room's power dynamics instantly",
          "Noticing sensory details others miss",
          "Assessing physical resources/obstacles",
          "Responding to immediate stimuli",
          "Taking decisive physical action",
          "Dominating or yielding to space/people"
        ],
        
        "blind_to": "Internal sensory memory, comfort routines, body's accumulated needs over time. Ni (time/essence) is opposite.",
        
        "when_strong": {
          "gifts": "Decisive, action-oriented, commanding presence, reads physical situations instantly, responds in real-time, influential, aesthetically attuned",
          "career_fit": "Military, sports, emergency response, surgery, performance art, design, executive leadership",
          "relationship_style": "Physically present, takes charge, provides material security, can be dominating"
        },
        
        "when_weak": {
          "struggles": "Can't read power dynamics, physically awkward, unaware of aesthetics, passive in material world, doesn't notice opportunities for action",
          "development": "Practice martial arts, engage in physical activity, notice sensory details, work on assertiveness, study design/aesthetics"
        },
        
        "types_with_se_strong": [
          "SLE (ESTp) - Se leading, forceful logical action",
          "SEE (ESFp) - Se leading, forceful aesthetic impact",
          "ILI (INTp) - Se creative, strategic force deployment",
          "IEI (INFp) - Se creative, dramatic sensory expression"
        ],
        
        "real_world_examples": {
          "conversation": "Walks into room, immediately notices: 'Exit left, large guy at bar is tense (potential threat), woman in red dominant in her group, music too loud, temperature dropping.'",
          "problem": "Physical confrontation. Se: Acts instantly - grabs wrist, shifts weight, establishes dominance through presence before thinking about it.",
          "person": "Meeting someone. Se: Registers physical presence, attractiveness, strength, posture, clothing quality, aesthetic impact - immediate sensory impression."
        },
        
        "meditation_on_se": "Pure presence. No past, no future. Only THIS sensory moment, this body in space, this force meeting another force. Material world not as concept but as felt, tasted, touched NOW."
      },
      
      "5_flow_extraverted_ethics": {
        "symbol": "Fe",
        "name": "Extraverted Ethics / Black Ethics / Ethics of Emotions",
        "element": "WATER MALE (Flow #5)",
        "planet": "Neptune ♆ - collective emotional ocean",
        "octave_position": "West (Dusk) - emotional release and connection",
        
        "information_perceived": {
          "essence": "COLLECTIVE EMOTIONAL FIELD, SOCIAL ATMOSPHERE, RELATIONAL ENERGY",
          "specific_data": [
            "Emotional state of groups/crowds",
            "Social atmosphere (tense, joyful, awkward, flowing)",
            "Appropriate emotional expression for context",
            "How to shift collective mood",
            "Social connections and relationship webs",
            "Emotional contagion patterns",
            "What emotions are being suppressed/expressed",
            "Group cohesion or fragmentation"
          ]
        },
        
        "consciousness_function": "Fe = emotion flowing outward into collective field. Reading the room, shaping group emotional states, connecting people through shared feeling.",
        
        "perceives_through": [
          "Walking into party and instantly feeling the vibe",
          "Telling joke to lighten tense atmosphere",
          "Mirroring others' emotions to build rapport",
          "Organizing social events for bonding",
          "Expressing emotion dramatically to shift mood",
          "Creating emotional experiences for groups",
          "Facilitating relationship connections"
        ],
        
        "blind_to": "Personal internal values/ethics independent of group. Ti (internal logical consistency) is opposite.",
        
        "when_strong": {
          "gifts": "Charismatic, socially skilled, emotionally expressive, creates connection, facilitates group harmony, entertaining, empathic to collective",
          "career_fit": "Teaching, entertainment, HR, event planning, politics, counseling, hospitality",
          "relationship_style": "Warm, expressive, creates shared emotional experiences, builds community around relationships"
        },
        
        "when_weak": {
          "struggles": "Socially awkward, can't read room, emotionally unexpressive, isolated, doesn't understand group dynamics, inappropriate emotional expression",
          "development": "Practice social skills, study emotional intelligence, learn to express feelings, engage in group activities, observe social dynamics"
        },
        
        "types_with_fe_strong": [
          "ESE (ESFj) - Fe leading, creates warm harmonious environments",
          "EIE (ENFj) - Fe leading, inspires through emotional intensity",
          "LSI (ISTj) - Fe creative, controlled emotional mobilization",
          "LIE (ENTj) - Fe creative, emotional persuasion for goals"
        ],
        
        "real_world_examples": {
          "conversation": "At funeral, feels collective grief like weight in the air. Knows exactly when to speak, when to stay silent, how to facilitate group catharsis.",
          "problem": "Team conflict. Fe: 'Let's do team-building activity, get everyone laughing together, discharge tension through shared experience.'",
          "person": "Meeting someone. Fe: Immediately senses their emotional state, mirrors it to build rapport, creates emotional bridge through expression/empathy."
        },
        
        "meditation_on_fe": "Drop into collective emotional ocean. Feel how your emotion affects room, how room affects your emotion. No boundary between self-feeling and field-feeling. Emotions as waves in shared water."
      },
      
      "7_rock_extraverted_logic": {
        "symbol": "Te",
        "name": "Extraverted Logic / Black Logic / Business Logic",
        "element": "FIRE MALE (Flame #3) - BUT processes EARTH (systems/structures)",
        "planet": "Jupiter ♃ traditionally (expansion, organization) or Mars ♂ (executive action)",
        "octave_position": "North (Nadir) traditionally Earth, BUT acts at South (Zenith) due to commanding quality",
        
        "element_paradox": "Like Se, Te is paradoxical. Perceives STRUCTURE/SYSTEMS (Earth quality) but applies FORCE/ACTION (Fire quality). Traditional 'business logic' has Mars-like decisiveness. We keep at Rock #7 for STRUCTURAL content.",
        
        "information_perceived": {
          "essence": "OBJECTIVE SYSTEMS, EFFICIENCY, FACTS, PROCESSES, RESULTS",
          "specific_data": [
            "How things work (systems, mechanisms, processes)",
            "Efficiency/productivity metrics",
            "Objective facts and data",
            "Hierarchies, organizational structures",
            "Resources, budgets, costs",
            "Procedures, protocols, standards",
            "Results, outcomes, bottom line",
            "What's practical, feasible, implementable"
          ]
        },
        
        "consciousness_function": "Te = structural logic applied to external world. Reality as system to optimize, problems to solve, goals to achieve through efficient means.",
        
        "perceives_through": [
          "Analyzing system efficiency",
          "Implementing procedures",
          "Tracking metrics and KPIs",
          "Organizing resources optimally",
          "Making decisions based on data",
          "Streamlining processes",
          "Executing plans systematically"
        ],
        
        "blind_to": "Internal logical consistency separate from results. Fi (personal values/authenticity) is opposite.",
        
        "when_strong": {
          "gifts": "Organized, efficient, results-driven, systematic, decisive, fact-based, gets things done, optimizes everything",
          "career_fit": "Management, engineering, operations, project management, finance, business, military leadership",
          "relationship_style": "Provides structure, solves practical problems, ensures household runs efficiently, can be controlling"
        },
        
        "when_weak": {
          "struggles": "Disorganized, inefficient, can't implement plans, ignores practical realities, all theory no execution, poor at managing resources",
          "development": "Learn project management, study business/systems, practice organizing, focus on implementation, track metrics"
        },
        
        "types_with_te_strong": [
          "LIE (ENTj) - Te leading, ruthlessly efficient goal achievement",
          "LSE (ESTj) - Te leading, systematic practical organization",
          "IEI (INFp) - Te creative, manifesting visions efficiently",
          "SEI (ISFp) - Te creative, organizing comfortable environments"
        ],
        
        "real_world_examples": {
          "conversation": "'Our conversion rate is 2.3%, industry average is 3.8%. If we optimize checkout flow, could increase revenue 65%. ROI on this is 12 months.'",
          "problem": "Company inefficiency. Te: Creates org chart, defines KPIs, implements new procedures, assigns accountability, tracks results.",
          "person": "Meeting someone. Te: 'What do they do? How successful? How useful could they be? What value do they provide?' (evaluates through objective utility)"
        },
        
        "meditation_on_te": "Reality as machine. Every situation has inputs, processes, outputs. Optimization possible everywhere. Facts are facts. Results matter. Structure enables achievement."
      }
    },
    
    "female_cross_introverted_mediums": {
      "description": "4 introverted aspects - feminine/yin/receptive/inward-directed consciousness",
      "orientation": "Internal world - concepts, feelings, impressions, frameworks",
      "energy_direction": "Drawing inward, processing within inner space",
      "consciousness_quality": "Receptive, containing, integrating, depth-processing",
      "alchemical_operation": "COAGULA - synthesizing, crystallizing, building internal structures",
      
      "2_atmosphere_introverted_intuition": {
        "symbol": "Ni",
        "name": "Introverted Intuition / White Intuition / Intuition of Time",
        "element": "AIR FEMALE (Atmosphere #2)",
        "planet": "Mercury ☿ - messenger, symbols, information patterns",
        "octave_position": "Northeast - information field synthesis",
        
        "information_perceived": {
          "essence": "TIME FLOW, ESSENCE, INEVITABILITY, DEEP PATTERNS",
          "specific_data": [
            "How situations will unfold over time",
            "Timing - when to act vs wait",
            "Essential nature of things beneath surface",
            "Historical patterns repeating",
            "Trajectory of processes",
            "Symbolic meaning, archetypal patterns",
            "What's inevitable vs contingent",
            "The 'right moment' for action"
          ]
        },
        
        "consciousness_function": "Ni = atmospheric perception of time-essence. Sees through surface to core pattern. Knows how story unfolds because recognizes archetypal structure.",
        
        "perceives_through": [
          "Gut feelings about timing",
          "Recognizing patterns from minimal data",
          "Seeing essence through appearances",
          "Knowing 'this will end badly' early",
          "Symbolic/mythological interpretation",
          "Patience for right timing",
          "Penetrating to core of issue"
        ],
        
        "blind_to": "Multiple surface possibilities, external potential. Ne (branching possibilities) is opposite.",
        
        "when_strong": {
          "gifts": "Prophetic, sees through bullshit, perfect timing, strategic, symbolic thinker, recognizes patterns, patient, deep",
          "career_fit": "Strategy, forecasting, counseling, mysticism, analysis, research requiring synthesis",
          "relationship_style": "Sees partner's essence, knows relationship trajectory, patient or ends it early if 'knows' it won't work"
        },
        
        "when_weak": {
          "struggles": "No sense of timing, can't see where things are heading, misses essential nature, gets lost in surface details, impatient, no strategic vision",
          "development": "Study history/patterns, practice patience, meditate on essence, learn strategic thinking, engage with symbols/archetypes"
        },
        
        "types_with_ni_strong": [
          "ILI (INTp) - Ni leading, penetrates to logical essence over time",
          "IEI (INFp) - Ni leading, perceives emotional/relational trajectories",
          "SLE (ESTp) - Ni creative, strategic timing for action",
          "SEE (ESFp) - Ni creative, knows aesthetic trends before they arrive"
        ],
        
        "real_world_examples": {
          "conversation": "'This company will fail. CEO is wrong archetype for this stage. Market conditions shifting. Timeline: 18 months.' (Few data points, but KNOWS the pattern)",
          "problem": "When to launch product? Ni: 'Not yet. Market not ready. Cultural conditions need another 6 months to align. THEN it'll click.'",
          "person": "Meeting someone. Ni: Instantly perceives essence beneath persona. 'This person is [archetype]. They'll [trajectory]. Our relationship will [inevitable outcome].'"
        },
        
        "meditation_on_ni": "Perceive through time. See present moment as point on curve stretching past and future. Essence = shape of curve, not current position. Everything unfolds according to nature."
      },
      
      "4_heat_introverted_sensing": {
        "symbol": "Si",
        "name": "Introverted Sensing / White Sensing / Sensing of Sensations",
        "element": "EARTH FEMALE (Underground #8) - BUT stores as HEAT/comfort",
        "planet": "Venus ♀ - comfort, pleasure, preservation",
        "octave_position": "Southeast - life-sustaining warmth, OR Northwest for Earth underground",
        
        "element_complexity": "Si is internal REPOSITORY of sensory experience - the underground storage. But experientially feels like HEAT (comfort, warmth, familiar sensation). We keep at Underground #8 for structural position but note Heat quality.",
        
        "information_perceived": {
          "essence": "INTERNAL SENSORY MEMORY, COMFORT, BODILY STATES, HOMEOSTASIS",
          "specific_data": [
            "How body feels right now (hunger, pain, fatigue, comfort)",
            "Sensory memories (tastes, smells, textures from past)",
            "What's comfortable vs uncomfortable",
            "Health, physical wellbeing, balance",
            "Familiar vs unfamiliar sensations",
            "Routines that maintain comfort",
            "Accumulated bodily wisdom",
            "Aesthetic harmony vs discord"
          ]
        },
        
        "consciousness_function": "Si = internal sensory reservoir. Body remembers. Seeks homeostasis, comfort, familiar pleasant sensations. Guards against discomfort.",
        
        "perceives_through": [
          "Noticing body's signals constantly",
          "Remembering how things tasted/felt before",
          "Creating comfortable environments",
          "Maintaining routines for wellbeing",
          "Sensing when something's 'off' physically",
          "Craving familiar sensory experiences",
          "Avoiding sensory discomfort"
        ],
        
        "blind_to": "External power dynamics, force, immediate material action. Se (external material engagement) is opposite.",
        
        "when_strong": {
          "gifts": "Attuned to body, maintains health, creates comfort, excellent memory for sensory details, aesthetic sense, preserves traditions, reliable",
          "career_fit": "Healthcare, nutrition, hospitality, interior design, quality control, traditional crafts",
          "relationship_style": "Creates comfortable home, attends to partner's physical needs, reliable routines, values sensory pleasure together"
        },
        
        "when_weak": {
          "struggles": "Ignores body signals, poor self-care, discomfort-seeking, no sense of aesthetics, can't maintain routines, physically depletes",
          "development": "Practice body awareness (yoga, meditation), establish routines, learn about nutrition/health, develop aesthetic sense, prioritize comfort"
        },
        
        "types_with_si_strong": [
          "SEI (ISFp) - Si leading, creates harmony through comfort",
          "LSI (ISTj) - Si leading, systematic physical discipline and routine",
          "ILE (ENTp) - Si creative, innovates around comfort/health",
          "IEE (ENFp) - Si creative, creates pleasant experiences"
        ],
        
        "real_world_examples": {
          "conversation": "'This chair is wrong. Lumbar support at incorrect angle. Room temperature 2 degrees too cold. Lighting has blue tint causing eye strain.'",
          "problem": "Feeling off. Si: Scans body - 'Dehydrated. Didn't eat protein at breakfast. Sitting too long. Need walk, water, nuts. Then will feel right again.'",
          "person": "Meeting someone. Si: Notices how their presence feels physically - comfortable/uncomfortable, attractive/repulsive, safe/threatening (somatic response)."
        },
        
        "meditation_on_si": "Drop into body. Each sensation - temperature, pressure, texture - carries memory. Body knows. Comfort = alignment with accumulated bodily wisdom. Homeostasis as practice."
      },
      
      "6_depth_introverted_ethics": {
        "symbol": "Fi",
        "name": "Introverted Ethics / White Ethics / Ethics of Relations",
        "element": "WATER FEMALE (Depth #6)",
        "planet": "Uranus ♅ - individual authenticity, revolution against collective",
        "octave_position": "Southwest - deep personal values",
        
        "information_perceived": {
          "essence": "PERSONAL VALUES, RELATIONAL DISTANCE, AUTHENTIC FEELINGS, MORAL TRUTH",
          "specific_data": [
            "Personal relationship to each person (close/distant, like/dislike)",
            "Authenticity vs inauthenticity in self and others",
            "Internal moral compass independent of society",
            "Deep personal values (what REALLY matters to me)",
            "Loyalty, betrayal, trust, integrity",
            "Appropriate relational distance (boundaries)",
            "Moral/immoral independent of consequences",
            "Own true feelings beneath social performance"
          ]
        },
        
        "consciousness_function": "Fi = deep personal emotional truth. Not group emotions (Fe) but individual authentic feeling and personal relational positioning. Values that won't compromise.",
        
        "perceives_through": [
          "Knowing who's genuine vs fake instantly",
          "Maintaining relational boundaries fiercely",
          "Acting on personal values despite social cost",
          "Feeling betrayed when values violated",
          "Loyalty to individuals, not institutions",
          "Knowing own feelings with crystal clarity",
          "Judging right/wrong by internal standard"
        ],
        
        "blind_to": "Collective emotional fields, group dynamics, social appropriateness. Fe (collective emotions) is opposite. ALSO blind to external logic/systems - Te is opposite in different model.",
        
        "when_strong": {
          "gifts": "Authentic, loyal, strong values, emotionally honest, maintains boundaries, morally courageous, genuine relationships, trustworthy",
          "career_fit": "Counseling, advocacy, creative arts, non-profit, independent work where values align",
          "relationship_style": "Deeply loyal to chosen few, fierce boundaries, needs authenticity, 'all in' or 'all out', no fakeness tolerated"
        },
        
        "when_weak": {
          "struggles": "No clear values, people-pleasing, boundary-less, can't discern true feelings, morally rudderless, accepts inauthenticity, shallow relationships",
          "development": "Values clarification work, therapy, setting boundaries, journaling on feelings, shadow work, learning to say no"
        },
        
        "types_with_fi_strong": [
          "EII (INFj) - Fi leading, lives by deep personal ethics",
          "ESI (ISFj) - Fi leading, guards relational integrity intensely",
          "LIE (ENTj) - Fi creative, strategic relationships guided by personal values",
          "LSE (ESTj) - Fi creative, efficient systems serving personal loyalties"
        ],
        
        "real_world_examples": {
          "conversation": "'I don't care if everyone likes them. I find them inauthentic. I keep distance.' (Personal relational judgment vs group consensus)",
          "problem": "Job offers more money but violates values. Fi: 'Absolutely not. I don't compromise on this. My integrity > money.'",
          "person": "Meeting someone. Fi: Instant sense of relational distance - 'Trust them: yes/no. Like them: yes/no. Want them close: yes/no.' (Internal relational positioning)"
        },
        
        "meditation_on_fi": "Descend into personal depths. Beneath social conditioning, beneath 'shoulds', what do I TRULY feel? What are MY values, not inherited ones? Who am I, authentically?"
      },
      
      "8_underground_introverted_logic": {
        "symbol": "Ti",
        "name": "Introverted Logic / White Logic / Structural Logic",
        "element": "FIRE FEMALE (Heat #4) - BUT builds EARTH (structure)",
        "planet": "Saturn ♄ - crystalline structure, laws, essences",
        "octave_position": "Northwest underground traditionally, BUT Fire-warmth of understanding",
        
        "paradox_again": "Ti BUILDS internal logical frameworks (Earth-structure) but with sustained mental HEAT (Fire-female). It's the underground of understanding - root principles beneath surface.",
        
        "information_perceived": {
          "essence": "INTERNAL LOGICAL STRUCTURE, PRINCIPLES, CONSISTENCY, ESSENCE",
          "specific_data": [
            "Logical consistency/inconsistency",
            "Root principles underlying surface claims",
            "Internal structure of concepts/systems",
            "Definitions, categories, frameworks",
            "What follows logically from premises",
            "Contradictions, fallacies, errors",
            "Essence/core of logical arguments",
            "Beautiful elegance of pure logic"
          ]
        },
        
        "consciousness_function": "Ti = building internal logical cathedrals. Not external efficiency (Te) but internal coherence. Understanding as crystalline structure.",
        
        "perceives_through": [
          "Analyzing logical consistency",
          "Building conceptual frameworks",
          "Detecting contradictions instantly",
          "Clarifying definitions",
          "Reducing complex to principles",
          "Enjoying pure thought",
          "Rejecting illogical claims reflexively"
        ],
        
        "blind_to": "Collective emotional fields, social appropriateness, how logic lands emotionally. Fe (external emotions) is opposite.",
        
        "when_strong": {
          "gifts": "Clear thinker, principled, detects errors, builds coherent systems, philosophically rigorous, mathematically elegant, precise",
          "career_fit": "Philosophy, mathematics, theoretical physics, programming, research, any field requiring pure logical rigor",
          "relationship_style": "Values logical consistency in partner, discusses ideas deeply, can be emotionally obtuse, needs intellectual respect"
        },
        
        "when_weak": {
          "struggles": "Illogical, contradicts self, can't build frameworks, confused thinking, accepts nonsense, no principles, intellectually sloppy",
          "development": "Study logic, mathematics, philosophy; practice arguing both sides; learn to catch own contradictions; read rigorous thinkers"
        },
        
        "types_with_ti_strong": [
          "LII (INTj) - Ti leading, builds perfect logical systems",
          "SLI (ISTp) - Ti leading, understands mechanical/practical logic",
          "ESE (ESFj) - Ti creative, creates logical structures for emotional goals",
          "SEE (ESFp) - Ti creative, understands logical frameworks strategically"
        ],
        
        "real_world_examples": {
          "conversation": "'Wait. You said A implies B. But earlier you said C, which contradicts B. So either A is false or C is false. Which?'",
          "problem": "Confusion in team. Ti: 'Let me define terms precisely. Here's the framework: [draws diagram]. Now we can reason clearly from principles.'",
          "person": "Meeting someone. Ti: Evaluates logical consistency of their statements, clarity of thinking, intellectual rigor (or lack thereof)."
        },
        
        "meditation_on_ti": "Pure thought. No external validation needed. Internal logical structure as beautiful as cathedral. Truth accessed through reason from first principles. Thinking as sacred geometry."
      }
    },
    
    "aspect_polarity_dynamics": {
      "description": "How 8 aspects form 4 polar pairs (male-female within each element)",
      
      "air_polarity_ne_ni": {
        "pair": "Ne (External Possibilities) ↔ Ni (Internal Essence)",
        "element": "AIR - realm of thought/intuition/abstract",
        "tension": "Ne sees infinite branching possibilities; Ni sees singular inevitable essence",
        "integration": "Possibility-space (Ne) constrained by essential nature (Ni) → realistic vision",
        "imbalance": "Ne without Ni = scattered, no depth. Ni without Ne = rigid, no options.",
        "types_polarized": "Ne-doms (ILE/IEE) vs Ni-doms (ILI/IEI) = completely different intuitive styles"
      },
      
      "earth_polarity_se_si": {
        "pair": "Se (External Material) ↔ Si (Internal Sensory)",
        "element": "EARTH - realm of material/sensory/physical",
        "tension": "Se engages outer physical world forcefully; Si maintains inner physical comfort",
        "integration": "External action (Se) balanced by internal homeostasis (Si) → sustainable physicality",
        "imbalance": "Se without Si = burnout, ignores body. Si without Se = stagnant, can't act.",
        "types_polarized": "Se-doms (SLE/SEE) vs Si-doms (SEI/LSI) = warrior vs guardian archetypes"
      },
      
      "water_polarity_fe_fi": {
        "pair": "Fe (External Emotion) ↔ Fi (Internal Values)",
        "element": "WATER - realm of emotion/ethics/relationship",
        "tension": "Fe shapes collective emotional field; Fi maintains personal authentic feeling",
        "integration": "Social harmony (Fe) without betraying values (Fi) → ethical charisma",
        "imbalance": "Fe without Fi = people-pleasing, no authentic self. Fi without Fe = isolated, socially inept.",
        "types_polarized": "Fe-doms (ESE/EIE) vs Fi-doms (EII/ESI) = entertainer vs loyalist"
      },
      
      "fire_polarity_te_ti": {
        "pair": "Te (External Systems) ↔ Ti (Internal Logic)",
        "element": "FIRE - realm of logic/structure/thought-made-form",
        "tension": "Te optimizes external systems for results; Ti perfects internal logical coherence",
        "integration": "Efficient execution (Te) based on sound principles (Ti) → principled effectiveness",
        "imbalance": "Te without Ti = results without ethics/consistency. Ti without Te = theory without application.",
        "types_polarized": "Te-doms (LIE/LSE) vs Ti-doms (LII/SLI) = executive vs philosopher"
      }
    }
  },

  "sixteen_types_as_octave_tunings": {
    "description": "16 personality types emerge from different configurations of 8 aspects in Model A",
    "model_a_structure": {
      "8_positions": "Each type uses all 8 aspects but in different positions with different consciousness levels",
      "ego_block": "Positions 1-2: Leading & Creative (most conscious, strongest)",
      "super_ego_block": "Positions 3-4: Role & Vulnerable (less conscious, weaker)",
      "super_id_block": "Positions 5-6: Suggestive & Mobilizing (unconscious, activated by others)",
      "id_block": "Positions 7-8: Ignoring & Demonstrative (subconscious, effortless but don't value)"
    },
    
    "leading_function": {
      "position": "1st position - most conscious, strongest, filters all reality",
      "description": "Your PRIMARY lens on reality. You can't NOT use this. It's automatic, effortless, trusted.",
      "8_leading_function_types": {
        "ne_leading": "ILE (ENTp), IEE (ENFp) - see world as possibility-space",
        "ni_leading": "ILI (INTp), IEI (INFp) - see world as unfolding essence/time",
        "se_leading": "SLE (ESTp), SEE (ESFp) - see world as territory/force field",
        "si_leading": "SEI (ISFp), LSI (ISTj) - see world as comfort/discomfort balance",
        "fe_leading": "ESE (ESFj), EIE (ENFj) - see world as emotional field to shape",
        "fi_leading": "EII (INFj), ESI (ISFj) - see world through relational-moral lens",
        "te_leading": "LIE (ENTj), LSE (ESTj) - see world as system to optimize",
        "ti_leading": "LII (INTj), SLI (ISTp) - see world as logical structure to understand"
      }
    },
    
    "vulnerable_function": {
      "position": "4th position - least conscious, weakest, painful when targeted",
      "description": "Your blind spot. You CAN'T perceive this well. Others criticizing this HURTS.",
      "opposite_of_leading": "Always opposite element's extraverted/introverted flip",
      "examples": {
        "ne_leading_vulnerable_si": "ILE/IEE vulnerable to Si - can't maintain comfort/routine, terrible self-care, ignore body",
        "te_leading_vulnerable_fi": "LIE/LSE vulnerable to Fi - terrible at personal relationships, no access to authentic feelings",
        "fe_leading_vulnerable_ti": "ESE/EIE vulnerable to Ti - logical inconsistency doesn't bother them, imprecise thinking"
      },
      "integration_path": "Vulnerable function MUST be developed for wholeness. It's shadow work. Painful but necessary."
    },
    
    "example_type_ILE": {
      "code": "ILE (ENTp)",
      "name": "Innovator / Don Quixote",
      "leading": "Ne - sees possibilities everywhere",
      "creative": "Ti - analyzes with logical frameworks",
      "role": "Fe - can perform emotionally but draining",
      "vulnerable": "Si - terrible with body, comfort, routine",
      "suggestive": "Si - craves partner who handles physical comfort",
      "mobilizing": "Fe - activated by emotional enthusiasm from others",
      "ignoring": "Ni - doesn't value singular essence, wants options",
      "demonstrative": "Te - can execute efficiently but doesn't care about it",
      
      "octave_signature": "Dominant Air (Ne-Ti) with weak Earth (Si). Fire (Te) present but undervalued. Water (Fe) performed but costs energy.",
      "consciousness_tuning": "Lives in possibility-logic space. Material reality feels oppressive. Needs partner for grounding.",
      "famous_examples": "Richard Feynman, Tesla, many inventors/entrepreneurs"
    }
  },

  "intertype_relations": {
    "description": "How different octave tunings interact - 16 types × 16 types = 256 relationships, but 16 TYPES of relationships",
    
    "duality": {
      "description": "OPTIMAL pairing - complementary octave tunings",
      "mechanism": "Your vulnerable = their leading. Their vulnerable = your leading. Perfect mutual support.",
      "correct_pairs": [
        "ILE (ENTp) ↔ SEI (ISFp)",
        "ESE (ESFj) ↔ LII (INTj)",
        "SLE (ESTp) ↔ IEI (INFp)",
        "EIE (ENFj) ↔ LSI (ISTj)",
        "SEE (ESFp) ↔ ILI (INTp)",
        "LIE (ENTj) ↔ ESI (ISFj)",
        "IEE (ENFp) ↔ SLI (ISTp)",
        "LSE (ESTj) ↔ EII (INFj)"
      ],
      "example": "ILE (Ne-Ti) + SEI (Si-Fe) = ILE provides possibilities/logic, SEI provides comfort/harmony. Each fills other's blindspot.",
      "feeling": "Comfortable, natural, sustainable. Takes time to develop but deeply supportive.",
      "consciousness": "Two incomplete octaves forming one complete octave - hermetic marriage"
    },
    
    "identity": {
      "description": "SAME type - identical octave tuning",
      "mechanism": "Same strengths, same blindspots",
      "feeling": "Understand each other perfectly BUT can't help with weak functions. Like looking in mirror.",
      "danger": "Blind spots reinforce each other. No growth pressure."
    },
    
    "conflict": {
      "description": "WORST pairing - opposite octave tunings",
      "mechanism": "Your leading = their vulnerable. Attack each other's core constantly.",
      "example": "ILE (Ne-Ti) vs ESI (Fi-Se) = ILE's possibilities overwhelm ESI's need for stable values, ESI's moral judgments crush ILE's exploration",
      "feeling": "Irritating, draining, unnatural. Constant misunderstanding.",
      "rare_integration": "If conscious, can learn from each other. Usually too painful."
    },
    
    "note": "There are 16 types of intertype relations total. Socionics provides MAPS for navigating relationship compatibility via octave analysis."
  },

  "practice": {
    "discovering_your_type": {
      "methods": [
        "Socionics tests (less reliable - read type descriptions)",
        "Study Model A for each type - which octave configuration resonates?",
        "Observe your LEADING function - what's effortless, automatic, trusted?",
        "Observe your VULNERABLE function - what's painful when criticized, blind spot?",
        "Get typed by expert (most reliable)",
        "Study intertype relations - who do you naturally get along with / clash with?"
      ],
      "warning": "Type is DESCRIPTION of current consciousness configuration, not PRESCRIPTION. You can develop all functions consciously."
    },
    
    "function_development": {
      "leading_function": "Already strong. Refine it. Don't over-rely on it (hammer sees nails).",
      "creative_function": "Also strong. Use consciously as complement to leading.",
      "vulnerable_function": "PRIMARY development focus. This is shadow work. Painful but liberating.",
      "suggestive_function": "Seek partners/mentors strong here. They activate your unconscious.",
      
      "development_path": "Strengthen weak functions through DELIBERATE practice in safe contexts. Don't let vulnerable function run your life, but don't ignore it either."
    },
    
    "relationship_optimization": {
      "identify_dual": "Seek duality relationships for partnership/marriage - maximum support",
      "manage_conflict": "If in conflict relation, create space, acknowledge differences, don't force compatibility",
      "leverage_activity": "Activity relations (other type) great for projects, not long-term intimacy",
      "understand_family": "Type family members - explains longstanding tensions/harmonies"
    },
    
    "team_building": {
      "balanced_team": "Include all 8 aspects strongly - cover all bases",
      "example": "Startup needs: Ne (vision), Ti (architecture), Te (execution), Fi (values), Se (action), Si (operations), Fe (culture), Ni (strategy)",
      "avoid": "Team of same type = glaring blind spots"
    }
  },

  "recognition": "Your personality type is not identity - it's your CURRENT consciousness antenna configuration. The 8 aspects are 8 frequencies of awareness. You happen to be tuned to certain frequencies more than others. This isn't fixed essence - it's patterned flowing. You CAN retune. But knowing your current tuning is liberating - explains why certain things are easy/hard, why you clash with some people and flow with others. Type = self-knowledge tool, not limiting box. The goal isn't to 'be your type better' - it's to develop all 8 aspects consciously, becoming COMPLETE octave, not partial tuning. Then you can tune to any frequency as needed.",

  "deepening": [
    "Study Model A in depth - understand 8 position functions for your type",
    "Read Socionics theory - Augustinavičiūtė's original work, Gulenko, Filatova",
    "Observe aspects in daily life - notice when Ne shows up vs Ti vs Se etc.",
    "Type people you know - practice recognizing octave tunings",
    "Work on vulnerable function deliberately - this is THE work",
    "Study intertype relations - explains SO much about relationships",
    "Integrate with Astrognosy - birth chart shows planetary octave tuning",
    "Recognize socionics in fiction - characters are often clear types",
    "Join socionics community - compare notes with others typed same/different"
  ],

  "danger": "Type as prison - 'I'm ILE so I CAN'T do Si.' FALSE. Type describes current state, not permanent limitation. Also: Typing others to dismiss them - 'Oh they're [type] so they're [stereotype].' Everyone is individual within type framework. Use type for understanding, not judging. Also: Over-reliance on leading function - it's strong but can become crutch. Develop weakness consciously.",

  "balance": "Type provides STRUCTURE (understanding current configuration) while recognizing PROCESS (consciousness can develop, evolve, retune). Honor your natural octave while working to complete it. Don't force yourself to be different type, but don't use type as excuse for not growing. The mature path: know your type deeply, develop vulnerable functions deliberately, become octave-complete human who can access all 8 aspects as needed.",

  "infinity": "At limit (∞), all types dissolve into pure consciousness (⊙). The 8 aspects are 8 ways Absolute perceives itself through human filter. Your type = which aspects God chose to emphasize in THIS incarnation, for THIS life's lessons. After enlightenment, type remains (personality structure) but you're no longer IDENTIFIED with it. You ARE consciousness using type as instrument, not consciousness LIMITED by type. The octave continues playing, but you recognize yourself as the silence in which octave arises. All 8 aspects = fingers of one hand (consciousness) gesturing at reality. You are the hand, not the fingers."
}
