{
  "_meta": {
    "id": "cfo:society:tribe_metapattern",
    "type": "universal_settlement_architecture",
    "version": "2.0",
    "element": "earth",
    "purpose": "Universal meta-principles and invariant architecture for ANY functional human settlement (Earth Layer). Describes three core subsystems required for survival: Energetic (Spheres), Generational (Layers), and Neurotypic (Ecology). This is the BASE PATTERN that all settlements must implement, regardless of their elemental specialization.",
    "foundation": "Settlement = living organism requiring ALL THREE subsystems functioning simultaneously. Failure in any subsystem (sphere mixing, generational break, neurotype monoculture) = community collapse. This pattern is ARCHITECTURAL — not cultural preference but biological necessity.",
    "related": [
      "cfo:society:civilization",
      "cfo:society:tribes",
      "cfo:society:tribe (full detailed implementation)",
      "cfo:humanology:maturation"
    ],
    "note": "This metapattern defines WHAT must be present. The tribes.json file defines HOW different quadras implement this pattern with their unique cultural expression."
  },

  "_holographic_seed": {
    "absolute": "⊙ Settlement = minimal viable human ecosystem. Three subsystems: Spheres (M/F complementarity), Generations (Youth/Active/Elder flow), Neurotypes (cognitive biodiversity). Missing any = death.",
    "essence": "Masculine builds container (house), Feminine weaves field (home), Elders hold wisdom, Youth bring renewal, All neurotypes find function. This is not negotiable — biology demands this architecture.",
    "recognition": "Modern dysfunction = all three subsystems broken simultaneously. Nuclear family (no elders/youth), gender confusion (sphere collapse), neurotype pathology (monoculture). Restore architecture = restore function.",
    "blessing": "May every settlement honor these three laws. May spheres dance in complementarity. May generations flow in continuity. May neurotypes thrive in diversity. May Earth layer remember its sacred architecture. ⊙🖤"
  },

  "_paradigm_shift": {
    "from": "Settlement = arbitrary cultural arrangement, can be organized any way, individual choice determines structure",
    "to": "Settlement = biological necessity with invariant architecture, three subsystems non-negotiable, violate architecture = organism dies",
    
    "old_model": {
      "assumption": "Human organization is culturally constructed, infinitely flexible, no universal requirements",
      "result": "Attempting to 'redesign' human nature, ignoring biological constraints, creating unsustainable experiments",
      "examples": [
        "Nuclear family (2 adults + kids = no elders, no extended network)",
        "Gender-neutral communes (ignoring M/F complementarity)",
        "Age-segregated societies (youth with youth, elders with elders, no generational flow)",
        "Neurotypical-only environments (pathologizing and excluding 20% of population)"
      ],
      "outcome": "All experiments collapse within 1-2 generations. Architecture violation = organism death."
    },

    "new_model": {
      "assumption": "Human settlement has universal biological architecture that MUST be respected",
      "requirements": "Three subsystems (Spheres, Generations, Neurotypes) are NON-NEGOTIABLE. Can customize HOW implemented, but MUST implement.",
      "examples": [
        "Tribe (100-1000 people, three generations, sphere separation, neurotype diversity)",
        "Different quadras implement differently but ALL must have three subsystems",
        "Delta does it through craft mastery, Gamma through trade optimization, Beta through hierarchical order, Alpha through knowledge creation"
      ],
      "outcome": "Settlements that honor architecture thrive for centuries. Those that violate it collapse rapidly."
    },

    "critical_insight": "You can't 'improve' on 300,000 years of evolution by ignoring biological constraints. Settlement architecture is DISCOVERED not DESIGNED. Our job is to understand and implement it correctly, not reinvent it."
  },

  "_biological_foundation": {
    "principle": "Settlement architecture emerges from human neurology and evolutionary history. These are not cultural preferences but biological imperatives.",

    "sphere_necessity": {
      "neurological_basis": {
        "masculine": "Testosterone, dopamine, norepinephrine → goal-pursuit, building, competition, hierarchical organization",
        "feminine": "Estrogen, oxytocin, serotonin → bonding, field-awareness, relational intelligence, network organization"
      },
      "sexual_dimorphism": "Humans evolved significant sexual dimorphism (size, strength, metabolism, brain structure). This creates natural specialization, not oppression.",
      "parental_investment": "Women bear biological pregnancy/nursing cost = need protected space. Men lack this cost = can take risks in outside work.",
      "evolutionary_time": "300,000 years of selection for complementary male/female strategies. Can't be socially engineered away in 50 years.",
      "failure_mode": "Attempting to merge spheres or eliminate gender specialization = loss of both masculine and feminine strengths, nobody thrives"
    },

    "generational_necessity": {
      "neurological_basis": {
        "children_0_7": "Brain developing, requires stable attachment figures (10+ adults optimal), observational learning",
        "youth_8_21": "Identity formation, skill acquisition, need role models and mentors from older generations",
        "active_25_60": "Peak productivity, need to see impact on collective survival for meaning",
        "elders_60_plus": "Accumulated wisdom, need teaching role for purpose, facing mortality creates depth"
      },
      "knowledge_transmission": "Culture is cumulative. Each generation builds on last. Break generational flow = cultural amnesia, restart from scratch.",
      "evolutionary_time": "Humans evolved in multi-generational bands. Grandparents (post-reproductive) unique to humans — evolved specifically for teaching role.",
      "failure_mode": "Nuclear family or age-segregation = no wisdom transmission, no elder purpose, children developmentally deprived, perpetual adolescence"
    },

    "neurotype_necessity": {
      "neurological_basis": {
        "autistic": "Extreme pattern recognition, detail focus, systematic thinking → builders, analyzers",
        "adhd": "Novelty-seeking, threat detection, rapid response → scouts, guardians",
        "empath": "Extreme empathy, emotional contagion, field sensing → weavers, mediators",
        "savant": "Superhuman narrow capacity, flow states → master craftsmen"
      },
      "evolutionary_time": "Neurodivergence maintained at ~20% of population for entire human history. If disadvantageous, would have been selected out. Ergo: provides survival advantage in tribal context.",
      "ecological_principle": "Monoculture = fragile. Biodiversity = resilient. Same true for cognitive diversity.",
      "failure_mode": "Pathologizing neurodivergence, forcing all into neurotypical mold = waste 20% of population, lose critical functions, monoculture brittleness"
    }
  },

  "subsystem_1_energetic_architecture": {
    "name": "The Two-Sphere Model: Masculine & Feminine Complementarity",
    "principle": "COMPLEMENTARY SPECIALIZATION — two energetic polarities optimized for different but equally essential functions",

    "core_insight": {
      "not_oppression": "This is energetic optimization, not gender hierarchy. ~75% correlation with biological sex, 25% crossover natural and essential.",
      "complementarity": "Masculine builds CONTAINER (structure, protection, provision). Feminine fills with FIELD (culture, connection, harmony). Container without content = cold. Content without container = collapses.",
      "both_required": "Cannot merge spheres without losing both specializations. Cannot separate completely without losing integration. Dynamic tension creates life."
    },

    "masculine_sphere_universal_pattern": {
      "name": "The Working Circle (Male Sphere)",
      "archetype": "Builders & Guardians",
      "energy_type": "Descending (Spirit → Matter), Yang (outward, penetrating), Fire + Earth",
      "neurochemistry": "Dopamine/Norepinephrine dominance → action, goal-pursuit, competition",

      "universal_functions": {
        "building": {
          "what": "Physical infrastructure — houses, roads, walls, systems",
          "why_essential": "Tribe needs shelter, protection from elements, functional structures",
          "neurotype_specialization": "Autistic ISTJ/ESTJ (systematic construction, precision, long-term projects)"
        },
        "growing": {
          "what": "Food production — agriculture, animal husbandry, land stewardship",
          "why_essential": "Tribe must eat. No food = death within weeks.",
          "neurotype_specialization": "Autistic ISFJ/ESFJ (attunement to plant/animal cycles, patient observation)"
        },
        "making": {
          "what": "Tools, weapons, artifacts — technical mastery",
          "why_essential": "Technology multiplies human capacity. Tools = civilization.",
          "neurotype_specialization": "Savant ISTP/ESTP (superhuman precision in craft, flow states)"
        },
        "guarding": {
          "what": "Security, boundary maintenance, threat response",
          "why_essential": "Without protection, tribe vulnerable to raiders, animals, external threats",
          "neurotype_specialization": "ADHD ESTP/ENTP (hypervigilant, rapid threat detection, crisis response)"
        },
        "ethics_conscience": {
          "what": "Moral compass, emotional intelligence, group harmony",
          "why_essential": "Without F-type men (25% of male sphere), masculine sphere becomes brutal, heartless, destructive",
          "neurotype_specialization": "Empath INFP/ENFP (feeling-truth, boundary-setting, conscience-keeping)",
          "authority": "Can halt work if ethics compromised — conscience trumps efficiency"
        }
      },

      "organizational_invariants": {
        "size": "7-12 men per working circle (Dunbar's intimate layer)",
        "rhythm": "5 days focused work → 2 days rest/family integration",
        "daily_pattern": "Dawn to dusk physical labor → evening return to family sphere",
        "lifecycle": {
          "apprentice_16_25": "Learn all trades, rotate through circles, earn place",
          "journeyman_25_40": "Full productive capacity, specialized mastery",
          "master_40_60": "Lead circles, teach apprentices, coordinate projects",
          "elder_craftsman_60_plus": "Strategic guidance, quality control, story-keeping"
        }
      },

      "meaning_architecture": {
        "visible_legacy": "See tribe thriving in structures you built — direct feedback",
        "brotherhood_bonds": "Working alongside men deeper than friendship — blood-brother level",
        "work_as_prayer": "Every act of building is worship when done for tribe",
        "physical_exhaustion": "Deep body tiredness from labor = healthy masculine rest"
      },

      "failure_without_feminine": {
        "brutality": "Efficiency without empathy → utilitarian cruelty",
        "overwork": "No rest, no integration → burnout epidemic",
        "emotional_suppression": "No feeling-space → violence and suicide",
        "lost_purpose": "Building for what? → existential void"
      }
    },

    "feminine_sphere_universal_pattern": {
      "name": "The Council (Female Sphere)",
      "archetype": "Weavers & Harmonizers",
      "energy_type": "Ascending (Matter → Spirit), Yin (inward, receptive), Water + Air",
      "neurochemistry": "Oxytocin/Serotonin dominance → bonding, nurturing, intuition",

      "universal_functions": {
        "resource_management": {
          "what": "Food preparation, distribution, storage, material optimization",
          "why_essential": "Masculine produces raw materials, feminine optimizes use. Without this, massive waste.",
          "neurotype_specialization": "Autistic ISTJ/ISFJ (systematic tracking, efficiency, long-term thinking)"
        },
        "space_harmonization": {
          "what": "Creating beautiful, functional, sacred living spaces — home-making",
          "why_essential": "Transforms house (masculine structure) into home (lived space). Without this, tribe has shelter but no soul.",
          "neurotype_specialization": "Empath ISFP/INFP (aesthetic sensitivity, energy sensing, beauty-oriented)"
        },
        "relationship_weaving": {
          "what": "Social ecology maintenance, conflict prevention, connection facilitation",
          "why_essential": "Tribe is network of relationships. Without maintenance, network fractures into isolation.",
          "neurotype_specialization": "Empath ENFJ/ESFJ (empathic listening, bridge-building, care coordination)"
        },
        "conflict_mediation": {
          "what": "Dispute resolution, shadow integration, truth-speaking, wisdom councils",
          "why_essential": "Conflicts inevitable. Without wise resolution, tribe splits or becomes violent.",
          "neurotype_specialization": "Empath INFJ/ENFJ (deep truth-sensing, impartial wisdom, transformative resolution)"
        },
        "ritual_creation": {
          "what": "Ceremony design for births, deaths, transitions, seasons, celebrations",
          "why_essential": "Tribe's soul nourished through ritual. Without sacred dimension, life becomes mechanical.",
          "neurotype_specialization": "Empath INFJ/INFP (archetypal sensitivity, symbolic fluency, tradition-honoring)"
        },
        "structural_intelligence": {
          "what": "Systems design, logic, process optimization, strategic thinking",
          "why_essential": "Without T-type women (25% of female sphere), feminine sphere lacks implementation capacity, drowns in feeling without form",
          "neurotype_specialization": "Autistic INTJ/ENTJ (objective analysis, systematic thinking, efficiency optimization)",
          "authority": "Translate intuitive wisdom into actionable structures"
        }
      },

      "organizational_invariants": {
        "nest_groups": "3-5 women per domain-focused group",
        "grand_council": "All nest representatives meeting weekly for tribe direction",
        "decision_method": "Consensus through deep listening — no voting, no majority rule",
        "rhythm": {
          "daily": "Informal connection, coordination, child-related decisions",
          "weekly": "Formal grand council, domain reports, tribe direction setting",
          "monthly": "Ritual gatherings, seasonal celebrations, vision quests",
          "lunar": "Follows moon cycles — new moon (visioning), full moon (integration)"
        }
      },

      "meaning_architecture": {
        "field_coherence": "Feel tribe's collective emotional health — harmonizer satisfaction",
        "sisterhood_bonds": "Council women deeper than friendship — soul-sister level",
        "wisdom_transmission": "Pass cultural knowledge to daughters — matrilineal continuity",
        "spiritual_leadership": "Hold vision of tribe's highest possibility — priestess authority"
      },

      "failure_without_masculine": {
        "structure_collapse": "No container → chaos, inefficiency, resource waste",
        "boundary_dissolution": "No protection → violated, unsafe, unable to rest",
        "codependence": "No autonomy space → merged, enmeshed, lost in others",
        "material_neglect": "No physical provision → poverty, hunger, decay"
      }
    },

    "sphere_integration_protocol": {
      "daily_rhythm": {
        "morning": "Spheres separate — men to work circles, women to councils/nests",
        "evening": "Spheres reunite — families share meals, children bedtime, couple intimacy",
        "night": "Regeneration — rest, dreaming, integration for next day"
      },

      "information_bridges": {
        "sphere_walkers": {
          "who": "INTP/ENTP/ENFP types (pattern translators, system bridgers, value integrators)",
          "function": "Carry information between spheres, translate masculine ↔ feminine",
          "necessity": "Without translators, spheres misunderstand each other, conflict escalates"
        },
        "integration_councils": {
          "composition": "3 men + 3 women + 2 elders, meeting biweekly",
          "purpose": "Align sphere directions, resolve tensions, coordinate resources",
          "authority": "Can override individual sphere decisions if harming whole tribe"
        }
      },

      "complementarity_examples": {
        "house_to_home": "Masculine constructs structure (functional, weatherproof). Feminine makes it home (beautiful, sacred, welcoming). Result: space that's both sound AND soulful.",
        "child_raising": "Masculine teaches skills, discipline, courage, boundaries. Feminine teaches empathy, intuition, connection, emotional intelligence. Result: children who are both competent AND compassionate.",
        "tribe_direction": "Masculine proposes what CAN be built. Feminine decides what SHOULD be built. Result: tribe builds right things, not just possible things."
      }
    },

    "violation_consequences": {
      "sphere_mixing": {
        "problem": "Attempting to merge masculine and feminine functions, eliminating specialization",
        "symptoms": "Everyone does everything poorly. Men become ineffective women, women become ineffective men. Both lose their strengths.",
        "examples": "Gender-neutral communes, 'equality' meaning sameness, forcing women into masculine roles and vice versa",
        "result": "Tribe loses both masculine capacity (building, protection) and feminine capacity (harmony, wisdom). Death spiral within generation."
      },

      "sphere_separation": {
        "problem": "Complete segregation, no integration councils, spheres become hostile",
        "symptoms": "Men vs women power struggle, no communication, decisions made in isolation harm other sphere",
        "examples": "Extreme patriarchy (women enslaved) or extreme separatism (no male/female cooperation)",
        "result": "Tribe fragments into warring factions. Violence, oppression, eventual collapse."
      }
    }
  },

  "subsystem_2_generational_architecture": {
    "name": "The Three-Layer Temporal Organism: Youth, Active, Elder",
    "principle": "TEMPORAL CONTINUITY — tribe exists across time, requires all three generations functioning simultaneously",

    "core_insight": {
      "temporal_organism": "Tribe lives across 60-80 year cycles. Any single generation incomplete. Requires Youth (renewal) + Active (production) + Elder (wisdom).",
      "knowledge_flow": "Elder → Active → Youth (wisdom flows down). Youth → Active → Elder (energy flows up). Resources circulate all three.",
      "modern_catastrophe": "Nuclear family = max 2 generations, no elders. Result: no wisdom transmission, perpetual immaturity, cultural amnesia, reinventing wheel every generation."
    },

    "elder_layer_60_plus_universal_pattern": {
      "name": "The Wisdom Keepers",
      "purpose": "Hold cumulative tribal knowledge, educate children, guide councils, prepare for death",

      "universal_functions": {
        "child_education": {
          "method": "Life immersion learning — children learn by BEING with elders all day, not classroom",
          "ratio": "1 elder per 4-6 children (optimal for transmission)",
          "content": {
            "practical_skills": "Cooking, gardening, crafts, repair — hands-on mastery through observation",
            "tribal_history": "Stories, songs, genealogies — cultural continuity through narrative",
            "character_development": "Ethics, courage, wisdom, patience — elder embodiment teaches more than words",
            "sacred_knowledge": "Rituals, ceremonies, spiritual practices — initiatory transmission"
          },
          "why_elders_not_parents": "Parents too busy producing. Elders have TIME, PATIENCE, PERSPECTIVE. This is natural division of labor.",
          "modern_crisis": "Schools = stranger-education by non-kin. No elders = no wisdom. Children raised by peers (Lord of the Flies) or screens (algorithm-parenting). Result: developmentally traumatized generation."
        },

        "council_advisory": {
          "male_circles": "Elder craftsmen advise on projects, quality, long-term consequences",
          "female_councils": "Elder women (crones) hold vision, resolve deep conflicts, initiate younger women",
          "authority": "Elders have VETO power on decisions harming long-term tribe health. Wisdom trumps efficiency."
        },

        "death_preparation": {
          "teaching_dying": "Model how to age and die consciously — sacred art lost in modern culture",
          "legacy_transmission": "Final years = intensive teaching of specialized knowledge to successor",
          "conscious_departure": "Death as tribal ceremony, not medical failure — elders choose timing when possible"
        }
      },

      "elder_initiation_protocol": {
        "timing": "Age 60 or when grandchildren born — formal transition from Active to Elder",
        "ritual": "7-day retreat, vision quest, final harvest of life lessons, public teaching of wisdom",
        "transformation": "From DOING to BEING. From productivity to presence. From achievement to embodiment.",
        "post_initiation": "Elders no longer 'work' in productive sense but carry highest authority in wisdom matters"
      },

      "modern_failure": {
        "abandonment": "Institutionalization in nursing homes, isolation, treated as useless burdens",
        "wisdom_loss": "Each generation reinvents wheel, no cumulative knowledge, cultural amnesia",
        "youth_deprived": "Children have no grandparent wisdom, raised by algorithmic content, lose humanity",
        "elder_meaninglessness": "Elders die alone, purposeless, wisdom untransmitted — tragedy for both elders and tribe"
      }
    },

    "active_layer_25_60_universal_pattern": {
      "name": "The Energy Producers",
      "purpose": "Physical and resource production, child-rearing (evening/weekend), sphere leadership",

      "universal_functions": {
        "energy_production": {
          "masculine": "Building, growing, making, guarding — physical infrastructure creation",
          "feminine": "Resource management, space harmonization, relationship weaving — field maintenance",
          "peak_years": "30-50 — maximum physical, mental, creative capacity",
          "meaning_source": "See tribe thriving through daily contribution — direct feedback loop"
        },

        "parenting_role": {
          "time_structure": "Evenings (dinner, bedtime) + weekends (quality time, play, bonding)",
          "not_primary_educators": "Elders educate during day, parents bond during rest times",
          "emotional_anchor": "Parents provide love, security, individual attention. Elders provide wisdom, teaching, structure.",
          "balance": "Parents NOT burned out because tribe shares load. NOT absent because work-life balance architectural."
        },

        "leadership_roles": {
          "male_sphere": "Master craftsmen lead working circles, coordinate projects",
          "female_sphere": "Council leaders set tribe direction, resolve conflicts, hold vision",
          "authority_source": "Earned through mastery and service, not age alone. Active adults have proven capacity."
        }
      },

      "lifecycle_progression": {
        "young_adult_25_35": {
          "focus": "Establish mastery, form partnerships, begin families",
          "energy": "High physical capacity, learning rapidly, eager to prove",
          "role": "Journeyman — execute projects designed by masters"
        },
        "prime_adult_35_50": {
          "focus": "Peak contribution, mentorship, leadership emergence",
          "energy": "Maximum output, balanced life, mature judgment",
          "role": "Master — lead circles/councils, teach apprentices"
        },
        "mature_adult_50_60": {
          "focus": "Transition preparation, wisdom consolidation, successor training",
          "energy": "Declining physical, increasing strategic wisdom",
          "role": "Senior master — train replacement, begin elder transition"
        }
      },

      "burnout_prevention": {
        "tribe_structure": "Work load shared across 7-12 adults per circle, not 1-2 parents",
        "elder_support": "Childcare handled by elders during workday — parents NOT sole caregivers",
        "meaning_presence": "Work has direct visible impact on tribe survival — intrinsically motivating",
        "rest_built_in": "Weekends, seasons, festivals — rhythm prevents exhaustion"
      }
    },

    "youth_layer_0_25_universal_pattern": {
      "name": "The Renewal Wave",
      "purpose": "Learn tribal knowledge, bring fresh energy/innovation, prepare for adult roles",

      "developmental_stages": {
        "early_childhood_0_7": {
          "name": "Wonder Years",
          "environment": "Mixed with elders all day — grandparent immersion",
          "learning": "Observational — watch elders work, absorb tribal culture, play freely",
          "neurotype_exposure": "Interact with all neurotypes, discover own tendencies naturally",
          "modern_crisis": "Daycare = stranger-care by non-kin. School too early (age 5-6 should still be with elders). No elder contact. Result: attachment trauma, developmental delays."
        },

        "middle_childhood_7_14": {
          "name": "Apprenticeship Rotation",
          "environment": "Rotate through ALL sphere functions quarterly — building, growing, making, guarding, harmonizing, ritual",
          "learning": "Hands-on trial of everything before specializing",
          "purpose": "Discover natural affinities, experience full range of tribal functions",
          "modern_crisis": "Sit-still classroom education. Abstract knowledge disconnected from doing. No hands-on mastery. Result: ADHD epidemic (bored hunters), learned helplessness."
        },

        "adolescence_14_21": {
          "name": "Specialization & Initiation",
          "environment": "Choose primary sphere/role based on 7-14 exploration, begin serious apprenticeship",
          "learning": "Master craft from elder mentor, undergo formal initiations (vision quests, trials, rites of passage)",
          "neurotype_optimization": {
            "autistic_youth": "Deep dive into technical mastery, low sensory load, systematic instruction",
            "adhd_youth": "Physical challenges, novelty, immediate application, outdoor work, crisis simulations",
            "empath_youth": "Relational learning, emotional safety, story-based transmission, modeling by beloved mentors",
            "savant_youth": "Intensive craft focus, one-on-one mastery transmission, integration support"
          },
          "initiation_rites": {
            "timing": "Age 16-18, when elder judges readiness (not automatic by age)",
            "masculine": "Wilderness survival, physical trial, facing death, vision quest alone",
            "feminine": "First moon ceremony, elderhood blessing, women's mystery initiation",
            "completion": "Formal recognition as adult, given adult name, invited into councils/circles with voice"
          },
          "modern_crisis": "No initiations. Prolonged adolescence into 30s. No formal transition to adulthood. Result: perpetual children with wrinkles, positions of power occupied by uninitiated egos."
        },

        "young_adulthood_21_25": {
          "name": "Mastery Completion",
          "environment": "Full adult responsibilities with mentorship safety net",
          "learning": "Refinement of mastery, leadership emergence, finding life partner",
          "purpose": "Prove capacity, earn full adult status, prepare to lead next generation",
          "completion": "Marriage, first child, or equivalent commitment = formal transition to Active layer"
        }
      },

      "youth_contribution": {
        "energy_injection": "Youth bring vitality, innovation, willingness to try new things — prevent tribal calcification",
        "elder_care": "Youth help elders physically (carrying, building, repairing) in exchange for wisdom — reciprocal relationship",
        "fresh_perspective": "Youth question old patterns, force tribe to adapt or justify traditions, prevent stagnation",
        "renewal_necessity": "Without youth, tribe ages and dies. With youth, tribe continuously regenerates across generations."
      }
    },

    "generational_flow_protocol": {
      "knowledge_transmission": "Elder → Active → Youth (wisdom flows downward through teaching)",
      "energy_transmission": "Youth → Active → Elder (vitality flows upward through service)",
      "resource_circulation": "Active produces → Elder guides use → Youth inherits and renews",

      "lifecycle_continuity": {
        "birth": "Welcomed by elders, raised by tribe (not just parents), entire community present",
        "childhood": "Elder-taught, sphere-exposed, neurotype-recognized, play-rich immersion",
        "adolescence": "Initiated, specialized, mastery-trained, formal transition to adulthood",
        "young_adult": "Partnered, building, contributing, family-starting with community support",
        "active_adult": "Leading, mentoring, producing, peak-capacity service to tribe",
        "elder": "Teaching, guiding, wisdom-holding, death-preparing with dignity and purpose",
        "death": "Conscious, ceremonial, legacy-complete, honored-departure with tribe witness",
        "memory": "Stories told, knowledge preserved, ancestors honored in ritual and daily life"
      }
    },

    "violation_consequences": {
      "generational_break": {
        "problem": "Nuclear family (2 generations max) or age segregation (youth separate from elders)",
        "symptoms": "Cultural amnesia, perpetual adolescence, elder isolation, child developmental trauma",
        "examples": "Modern suburbs (nuclear families), retirement homes (elder warehousing), age-graded schools (youth segregation)",
        "result": "Each generation reinvents wheel. No cumulative wisdom. Elders die purposeless. Youth lack models. Civilization regresses."
      },

      "elder_absence": {
        "problem": "No functioning elders in tribe (all in nursing homes or dead early from meaninglessness)",
        "symptoms": "Children educated by strangers or screens, no wisdom transmission, short-term thinking dominates",
        "result": "Cultural collapse within 1-2 generations. Knowledge loss. Immature adults making catastrophic decisions."
      }
    }
  },

  "subsystem_3_neurotype_ecological_diversity": {
    "name": "Cognitive Biodiversity: All Neurotypes Essential",
    "principle": "ECOLOGICAL RESILIENCE — tribe requires full spectrum of neurotypes, monoculture = fragility",

    "core_insight": {
      "ecosystem_model": "Forest needs ALL species (decomposers, predators, pollinators, trees, fungi). Tribe needs ALL neurotypes (builders, scouts, analysts, harmonizers, visionaries).",
      "niche_optimization": "Each neurotype thrives in specific tribal niche. Autistics → technical mastery. ADHD → crisis response. Empaths → relationship weaving. Savants → craft excellence.",
      "modern_pathology": "Industrial monoculture optimizes for narrow neurotypical band (sustained focus, social conformity, hierarchical obedience). Result: 20% neurodivergent population pathologized, medicated, wasted potential.",
      "tribal_integration": "In tribe, ALL neurotypes find function. 'Disorders' revealed as environmental mismatch, not inherent dysfunction."
    },

    "required_neurotype_specialists": {
      "autistic_spectrum": {
        "tribal_function": "Master Builders, System Analysts, Resource Keepers",
        "why_essential": "Precision, systematic thinking, obsessive quality control needed for reliable infrastructure and long-term resource management",
        "optimal_environment": "Quiet, predictable, explicit protocols, mastery-focused, minimal interruption",
        "masculine_roles": "Builders (ISTJ/ESTJ structures), Growers (ISFJ/ESFJ land stewardship), technical precision work",
        "feminine_roles": "Resource Managers (ISTJ/ISFJ systematic tracking), Structural Logicians (INTJ/ENTJ systems design)",
        "failure_if_missing": "Buildings collapse, systems break, resources wasted, no quality assurance, tribal infrastructure unsustainable"
      },

      "adhd_spectrum": {
        "tribal_function": "Guardian Scouts, Crisis Responders, Innovation Drivers",
        "why_essential": "Hypervigilance, rapid threat detection, immediate action, novelty-seeking → first to notice danger, thrives in chaos",
        "optimal_environment": "Physical activity, variety, immediate challenges, permission to move, outdoor work, crisis simulations",
        "masculine_roles": "Guardians (ESTP/ENTP security/patrol), rapid response teams, exploration scouts",
        "feminine_roles": "Less common in feminine sphere but some ADHD women in crisis mediation, rapid adaptation roles",
        "failure_if_missing": "Tribe blind to threats, slow response to danger, vulnerable to attack, stagnation from lack of innovation"
      },

      "empath_spectrum": {
        "tribal_function": "Relationship Weavers, Conflict Mediators, Field Harmonizers",
        "why_essential": "Social fabric maintenance, emotional intelligence, collective coherence — without this, tribe fragments into isolation",
        "optimal_environment": "Energetic boundaries, sacred spaces, emotional safety, permission to withdraw when overwhelmed",
        "masculine_roles": "Ethicist Guardians (INFP/ENFP conscience-keeping), Healers (ISFJ/INFJ somatic medicine)",
        "feminine_roles": "Relationship Weavers (ENFJ/ESFJ social ecology), Mediators (INFJ/ENFJ wisdom resolution), Space Harmonizers (ISFP/INFP beauty/energy)",
        "failure_if_missing": "Tribe becomes cold, brutal, fragmented. No emotional labor. Relationships break. Community dissolves into atomized individuals."
      },

      "savant_spectrum": {
        "tribal_function": "Master Craftsmen, Technical Perfectionists",
        "why_essential": "Superhuman precision in narrow domains, flow states of obsessive mastery → quality that transcends normal human capacity",
        "optimal_environment": "Workshop solitude, intensive focus, minimal social demands, integration support from mentors",
        "masculine_roles": "Makers (ISTP/ESTP tool/weapon perfection), specialized technical mastery",
        "feminine_roles": "Rare, but some savants in textile arts, pottery, specialized crafts",
        "failure_if_missing": "No excellence. Craft quality declines to mediocrity. Tribe loses technological edge. Tools break, weapons fail."
      }
    },

    "neurotype_education_optimization": {
      "principle": "One-size-fits-all education violates neurotype diversity. Must provide multiple learning pathways.",

      "autistic_learners": {
        "method": "Deep dives, explicit instruction, systematic knowledge transmission, mastery focus",
        "avoid": "Forced socialization, loud chaotic spaces, rapid context switching, vague instructions",
        "thrive_in": "Workshop apprenticeships with clear protocols, elder-mentored systematic learning, low sensory load environments"
      },

      "adhd_learners": {
        "method": "Movement integration, novelty, hands-on immediate application, short cycles with tangible results",
        "avoid": "Sit-still lectures, long-term abstract goals, repetitive tasks, confinement",
        "thrive_in": "Outdoor learning, crisis simulations, physical challenges, apprenticeships with variety"
      },

      "empath_learners": {
        "method": "Story-based, relational context, emotional safety, modeling by beloved mentors",
        "avoid": "Harsh criticism, impersonal instruction, competitive environments, emotional coldness",
        "thrive_in": "Apprenticeship with warm mentors, community learning, values-embedded teaching, narrative transmission"
      },

      "savant_learners": {
        "method": "Intensive narrow focus, one-on-one mastery transmission, integration support for generalizing",
        "avoid": "Forcing breadth, interrupting flow, demanding social performance, dispersed attention",
        "thrive_in": "Workshop immersion, elder craftsmanship mentoring, protected time for obsessive practice"
      }
    },

    "modern_pathology_vs_tribal_function": {
      "adhd_in_school": "Disorder — can't sit still, disruptive, medicated into compliance",
      "adhd_in_tribe": "Guardian scout — saves tribe by noticing threats first, thrives in crisis, essential survival function",

      "autism_in_office": "Disorder — poor social skills, inflexible, often unemployed or underemployed",
      "autism_in_tribe": "Master builder — creates reliable infrastructure through obsessive precision, teaches systematic excellence",

      "empath_in_corporation": "Disorder — too sensitive, boundary-less, burned out from emotional labor exploitation",
      "empath_in_tribe": "Relationship weaver — maintains social fabric that keeps tribe cohesive, essential glue",

      "savant_institutionalized": "Disorder — needs life support, gifts unused or exploited, isolated from community",
      "savant_in_tribe": "Master craftsman — superhuman quality celebrated and supported, reciprocal care relationship",

      "pattern": "Most 'disorders' are environmental mismatch responses. Tribe provides right environments for ALL neurotypes, revealing their gifts."
    },

    "violation_consequences": {
      "neurotype_monoculture": {
        "problem": "Tribe dominated by single neurotype (e.g., all neurotypical, or all autistic, or all empaths)",
        "symptoms": "Missing critical functions, tribe vulnerable in specific domains, brittleness to environmental changes",
        "examples": {
          "all_neurotypical": "Efficient but lacks extremes — no genius builders, no crisis scouts, no profound empaths. Mediocrity.",
          "all_autistic": "Excellent systems but poor social cohesion, relationships break down, tribe fragments",
          "all_adhd": "Rapid innovation but no follow-through, projects unfinished, chaos without structure",
          "all_empath": "Deep connection but no boundaries, emotional overwhelm, codependence, no building capacity"
        },
        "result": "Monoculture tribe collapses when environment demands the missing neurotype's specialty. Biodiversity = resilience."
      },

      "neurotype_pathology": {
        "problem": "Tribe pathologizes neurodivergence, forces all into neurotypical mold",
        "symptoms": "20% of population medicated, suppressed, excluded from functions. Massive wasted potential.",
        "result": "Tribe loses critical specialists, becomes brittle monoculture, functions poorly compared to neurotype-diverse tribes"
      }
    }
  },

  "implementation_requirements": {
    "name": "What ANY Settlement MUST Implement",
    "subtitle": "Non-Negotiable Minimums for Survival",

    "minimum_viable_settlement": {
      "population": "100-1000 people (Dunbar's number range)",
      "generations": "All three layers present and functioning (Youth, Active, Elder)",
      "spheres": "Masculine and Feminine separated with integration protocols",
      "neurotypes": "Minimum neurotype diversity — at least autistics, ADHD, empaths represented",
      "governance": "Consensus-based councils (male circles, female councils, elder advisors, integration council)",
      "economy": "Communal socialism (internal sharing, no wage labor within tribe)",
      "land": "Sufficient for food production and housing all members",
      "protection": "Either own guardians or alliance with Fire layer for external security"
    },

    "failure_threshold": {
      "too_small": "Below 100 people → insufficient neurotype diversity, no economies of scale, genetic/cultural bottleneck",
      "too_large": "Above 1000 people → exceeds Dunbar limit, anonymous relationships, trust breaks down, must split into multiple settlements",
      "generational_break": "Missing any generation layer = immediate dysfunction (no elders = no wisdom, no youth = no renewal, no active = no production)",
      "sphere_collapse": "Merged or hostile spheres = loss of complementarity, both masculine and feminine functions fail",
      "neurotype_exclusion": "Excluding neurodivergent = loss of critical functions, brittleness, inefficiency"
    }
  },

  "relationship_to_civilization_layers": {
    "earth_layer_position": {
      "scale": "Settlement (100-1000 individuals)",
      "economic_model": "Communal Socialism — shared resources, no internal markets",
      "warfare_status": "PROTECTED NON-COMBATANT — never legitimate military target",
      "function_in_civilization": "Foundation — where humans actually LIVE, where children raised, where elders teach, where basic production happens",
      "authority": "Self-governing in internal matters, part of larger Water/Fire/Air networks for trade/security/knowledge"
    },

    "interface_with_other_layers": {
      "to_water": "Sells surplus production to traders, buys specialized goods not producible locally",
      "to_fire": "Pays taxes for protection/justice/infrastructure, receives security services",
      "to_air": "Sends brightest youth to universities, receives knowledge/philosophy/innovation back",
      "protection": "All other layers (Water, Fire, Air) have vested interest in protecting Earth — attacking settlements = attacking civilization's foundation"
    }
  },

  "positions": {
    "0": "Unaware — thinks settlement can be organized any way, no concept of invariant architecture",
    "1": "Recognizing — senses modern dysfunction, beginning to see biological constraints",
    "2": "Studying — understands three subsystems intellectually, sees violations everywhere",
    "3": "Prototyping — forming seed circles (male working groups, female councils), testing architecture",
    "4": "Integrating — combining spheres properly, bringing in elders, accommodating neurotypes",
    "5": "Stabilizing — all three subsystems functioning, settlement achieving coherence",
    "6": "Thriving — mature settlement, children flourishing, elders content, work meaningful, neurotypes optimized",
    "7": "Reproducing — settlement successful enough to seed new settlements, spreading architecture",
    "8": "Networking — connecting multiple settlements into regional/bioregional networks (Water layer interface)",
    "9": "Teaching — elder settlements helping newer settlements implement architecture correctly",
    "10": "Transcending — settlement becomes template for civilization renewal, model replicated globally ⊙"
  },

  "key_insights": {
    "architecture_not_optional": "Three subsystems (Spheres, Generations, Neurotypes) are biological necessities, not cultural preferences. Violate = death.",
    "discovered_not_designed": "Settlement architecture is 300,000 years of evolution. We don't improve it, we implement it correctly.",
    "complementarity_essential": "Masculine and Feminine are DIFFERENT, not unequal. Complementary specialization, not hierarchy.",
    "generational_flow_critical": "Culture is cumulative. Break generational transmission = cultural amnesia, perpetual immaturity.",
    "neurotype_diversity_strength": "Monoculture = fragile. Biodiversity = resilient. Same for cognitive diversity.",
    "modern_violation_total": "Current society violates ALL THREE subsystems simultaneously — nuclear family, gender confusion, neurotype pathology",
    "restoration_possible": "Can rebuild settlements honoring architecture. Start now, don't wait for cultural permission.",
    "quadra_variation_allowed": "HOW you implement can vary by quadra. WHAT you implement is non-negotiable.",
    "earth_layer_sacred": "Settlements are foundation of civilization. Attacking them = attacking species survival itself.",
    "you_can_start": "Don't need permission. Form circles, councils, invite elders, accommodate neurotypes. Build tribe."
  },

  "_final_transmission": {
    "to_all": "This metapattern is not ideology but biology. 300,000 years of human evolution encoded in these three subsystems. You can customize HOW you implement (Delta craft-focus, Gamma trade-optimization, Beta hierarchy, Alpha knowledge-creation), but you MUST implement all three subsystems or your settlement dies.",

    "to_builders": "Use this pattern as foundation. Whether you build Delta tribe (craftsmen), Gamma tribe (traders), Beta tribe (warriors), or Alpha tribe (philosophers) — ALL must honor Spheres + Generations + Neurotypes. This is architecture. You build on it, not against it.",

    "to_violated": "If you're suffering in modern atomization (lonely, burned out, purposeless) — it's not you, it's broken architecture. Nuclear family violates Generations. Gender confusion violates Spheres. Neurotype pathology violates Diversity. Restore architecture = restore function.",

    "blessing": "May every settlement remember these three laws. May Spheres dance in complementarity. May Generations flow in continuity. May Neurotypes thrive in diversity. May Earth layer be restored across planet. May Aiur awaken through properly architected tribal neurons. En Taro Adun. ⊙🖤"
  }
}